[
    {
        "name": "Coders at work",
        "children": [
            {
                "name": "Brad Fitzpatrick",
                "children": [
                    {
                        "name": "Maintainer for life",
                        "text": "<i>I've also done a lot of testing since LiveJournal.\nOnce I started working with other people\nespecially. And once I realized that code I write\nnever fucking goes away and I'm going to be a\nmaintainer for life.</i> I get comments about blog\nposts that are almost 10 years old. “Hey. I found\nthis code. I found a bug,” and I'm suddenly\nmaintaining code.",
                        "id": 1
                    },
                    {
                        "name": "Tests to guard",
                        "text": "to tell them that they messed up. <i>I had to force\na lot of people to write tests, mostly people who\nwere working for me. I would write tests to guard\nagainst my own code breaking, and then once they\nwrote code. I was like, “Are you even sure that\nworks? Write a test. Prove it to me.”</i> At a certain\npoint, people realize, “Holy crap, it does pay off,”\nespecially maintenance costs later.",
                        "id": 2
                    },
                    {
                        "name": "About memcached",
                        "text": "memcached until like right after college, right\nwhen I moved out. <i>I remember coming up with\nthe idea. I was in my shower one day. The site\nwas melting down and I was showering and then\nI realized we had all this free memory all over the\nplace.</i> I whipped up a prototype that night, wrote\nthe server in Perl and the client in Perl.",
                        "id": 3
                    },
                    {
                        "name": "Win a race",
                        "text": "mediocrity required not to get fired. It’s about\nbeing awesome. It’s about winning. <i>You don’t win a\nrace by trying not to lose. And you don’t win at life\nby trying not to suck</i>. Fortunately, the content of\nthe book has never been about trying not to suck</i>. I\ncan’t think that way, and neither should you.",
                        "id": 4
                    },
                    {
                        "name": "Write something complex",
                        "text": "Fitzpatrick: Oh, yeah. I definitely try to find an\nexcuse to use anything, to learn it. <i>Because you\nnever learn something until you have to write\nsomething in it, until you have to live and breathe\nit.</i> It's one thing to go learn a language for fun, but\nuntil you write some big, complex system in it, you\ndon't really learn it.",
                        "id": 5
                    },
                    {
                        "name": "Formal education",
                        "text": "terminology. Prior to that. I knew programming\npretty well but I didn't have the vocabulary to\ndescribe what it was I was doing. <i>Or I would make\nup my own terminology for it and people would\nthink I didn't know what I was talking about.\nFormal C.S. education helped me be able to talk\nabout it.</i>",
                        "id": 6
                    },
                    {
                        "name": "Hard parts first",
                        "text": "Fitzpatrick: Sometimes. But I've started with the\nhard bits or the parts I was unsure of, and tried\nto implement those parts first. <i>I try not to put\noff anything hard or surprising to the end; I enjoy\ndoing the hard things first.</i> The projects that I\nnever finish—my friends give me shit that it's a\nwhole bunch—it's because I did the hard part.",
                        "id": 7
                    },
                    {
                        "name": "Reading code",
                        "text": "Then I really enjoyed reading code, because\nwhenever I didn't understand some pattern. I was\nlike, <i>“Wait, why the fuck did they do it like this?”\nand I would look around more, and I'd be like,\n“Wow, that is a really clever way to do this. I see\nhow that pays off.”</i> I would've done that earlier but\nI was afraid to do it because I was thinking that if it\n‘wasn't my code. I wouldn't understand it.",
                        "id": 8
                    },
                    {
                        "name": "Strict style guide",
                        "text": "Having worked at Google with really strict style\nguidelines in all languages. <i>On our top six or seven\nlanguages, there's a really strict style guide that\nsays</i>, “This is how we lay out our code. This is how\nwe name variables. This is how we do spacing and\nindentation, and these patterns and conventions\nyou use, and this is how you declare a static field.”",
                        "id": 9
                    },
                    {
                        "name": "Fear driven advice",
                        "text": "Your parents would rather you be OK than have a\nremarkable career at the cost of great personal risk.\n<i>More than any other third party you might look\nto, your parents are going to give you fear-driven\nadvice. Fear-driven advice is geared toward not\nlosing.</i> Thinking about not losing is not the way to\nwin! Winners take risks.",
                        "id": 10
                    },
                    {
                        "name": "Google deadlines",
                        "text": "“Yay! A deadline!” and I get so excited that\nthe adrenaline kicks in, and I work, and I finish\nthe damn thing. <i>Nothing with Google is really a\ndeadline. With Google it's like, “What do you think\nabout launching this? How does that feel?”</i> It's rare\nthat there's some real deadline.",
                        "id": 11
                    },
                    {
                        "name": "People complacency",
                        "text": "all be self-driven like me. <i>That was a learning\nexperience in HR, that some people just do what\nthey're told and don't really have a passion\nfor excellence</i>. They're just like, “Done. Next\nassignment,” Or they don't tell you and just browse\nthe Web. So I had a couple of painful experiences.\nBut I think, after a year or two of that, I learned that\npeople are different.",
                        "id": 12
                    },
                    {
                        "name": "Purist programmers",
                        "text": "Some are purists. They would just do abstraction\non abstraction on abstractions. They would go\nreally slowly and are very religious about their\nstyle. <i>They're like, “I'm an artisan programmer.”\nAnd I was like, “Your code doesn't run. It's not\nefficient and it doesn't look like any of the other\ncode that you're interacting with.”</i>",
                        "id": 13
                    },
                    {
                        "name": "People motivations",
                        "text": "Other people I eventually figured out what\nmotivated them. One guy was really good at\ntinkering and getting a prototype working. He\nwrote sysadmin Perl. <i>He could wire stuff together,\nwrite shell scripts, and write really bad Perl and\nreally bad C, but kind of get it working.</i> Then we\nwould be like, “Holy crap, you researched all this\nstuff, you got all these components talking to each\nother?”",
                        "id": 14
                    },
                    {
                        "name": "Side projects",
                        "text": "Fitzpatrick: I often look for people that have done,\nlike, a lot of stuff on their own that wasn't asked\nof them. <i>Not just their school project or just what\ntheir previous employer had them do. Somebody\nwho was passionate about something and had\nsome side project.</i> How did they maintain it and\nhow serious did they get with it? Or do they do a lot\nof quick hacks and abandon them?",
                        "id": 15
                    },
                    {
                        "name": "Real understanding",
                        "text": "someone could teach you something and you're\nlike, <i>“Yeah, yeah, sure. I understand.” You delude\nyourself but once you actually have to get down\nand do it at a real level and understand all the\ncorner cases, it forces you to actually learn the\nthing.</i> But I don't know if that would work for\neveryone.",
                        "id": 16
                    },
                    {
                        "name": "Smaller parts",
                        "text": "But a lot of times lately, if there's something weird\ngoing on. I'm like, <i>“OK, that function is too big;\nlet's break that up into smaller parts and unit-test\neach one of them separately to figure out where my\nassumptions are wrong</i>, rather than just sticking\nin random printIns.”",
                        "id": 17
                    },
                    {
                        "name": "About optimization",
                        "text": "Fitzpatrick: <i>Optimization is fun because it's not\nnecessary. If you're doing that, you've got your\nthing working and nothing else is more important</i>\nand you're either saving money or doing it\nbecause it's like a Perl golf contest ...",
                        "id": 18
                    },
                    {
                        "name": "Logic and statistics",
                        "text": "<i>You don't need that much math. For most programmers, \nday to day, statistics is a lot more important.</i> \nIf you're doing graphics stuff,\nmath is a lot more important but most people\ndoing Java enterprise stuff or web stuff, it's not.\nLogic helps and statistics comes up a lot.",
                        "id": 19
                    },
                    {
                        "name": "Social kid",
                        "text": "a general life thing, right? <i>There was some study\nabout who was successful after high school. Was it\nthe smart kids or the social kids?</i> It turned out that\nit was the social kids who ended up making all the\nmoney in life, not the people with the good grades.\nI thought that was interesting.",
                        "id": 20
                    },
                    {
                        "name": "Bridge engineer",
                        "text": "I have a friend who's a structural engineer\nand he went to school forever and took all\nthis engineering certification stuff. <i>It's kind of\ncomforting to know that the people who build the\nbridges I'm on studied this shit forever</i> and took\ntons of tests and stayed up all the time studying.",
                        "id": 21
                    },
                    {
                        "name": "Competing",
                        "text": "stop and work on fun things on my own. <i>I don't\nfeel like I'm competing with anyone right now\nand I don't really care if other people are better\nbecause I feel like there are tons of people who are\nbetter already.</i> I figure we are always in the middle\nanyway, so I'm happy to stay in the middle.",
                        "id": 22
                    }
                ]
            },
            {
                "name": "Douglas Crockford",
                "children": [
                    {
                        "name": "Language changes",
                        "text": "have the potential costs of disruption which, as\nyou become bigger, become unacceptable. <i>When\nyou're really successful, you need to be extremely\ncautious in any changes that you make.</i> Whereas\nif you haven't made it yet, you have a lot more\nfreedom in changing it around.",
                        "id": 23
                    },
                    {
                        "name": "Ajax accident",
                        "text": "The language got frozen in 1999 and then should have gone\ninto neglect and died. <i>But instead, by accident,\nAjax happened and suddenly it's the world's most\nimportant programming language.</i>",
                        "id": 24
                    },
                    {
                        "name": "Js worst feature",
                        "text": "<i>The worst feature of JavaScript, without question,\nis its dependence on a global object.</i> It doesn't have\nlinkers, it doesn't have any kind of information\nhiding between compilation units. It all gets\ndumped together into a common global object.",
                        "id": 25
                    },
                    {
                        "name": "GWT js ignorant",
                        "text": "Because <i>I worry about the abstraction leakage. If\nthere's a problem in your Java code or in GWT or\nin what it produces on the other side, you may or\nmay not have a place to stand to deal with that.</i>\nParticularly if you took the approach that you can\nafford to be completely ignorant about JavaScript\nbecause the language is hidden from you.",
                        "id": 26
                    },
                    {
                        "name": "Js smaller",
                        "text": "Crockford: I think the best way to make JavaScript\nbetter would be to make it smaller. <i>If we could\njust get it down to what it does really well and\nremove the features that add little or no value,\nit's actually a better language.</i> And I think we can.",
                        "id": 27
                    },
                    {
                        "name": "Ajax libraries",
                        "text": "Where we do have a problem is that <i>there are too\nmany Ajax libraries. That was a consequence of the\nfact that JavaScript is so powerful and the need\nis so profound and that they're easy to make.</i> So\nfor a while everybody was making them.",
                        "id": 28
                    },
                    {
                        "name": "Jquery selector",
                        "text": "One thing that we're seeing now is that the Ajax\nlibraries are converging. <i>jQuery came up with\na notation for using CSS selectors for getting a\nlist of objects from the DOM and then providing\nmethods for manipulating the objects en masse.</i>\nAnd that turns out to be a really good idea and\nit's something that JavaScript does very effectively.",
                        "id": 29
                    },
                    {
                        "name": "Code reading",
                        "text": "Crockford: One of the things I've been pushing is\ncode reading. <i>I think that is the most useful thing\nthat a community of programmers can do for\neach other—spend time on a regular basis reading\neach other's code.</i>",
                        "id": 30
                    },
                    {
                        "name": "Code reading schedule",
                        "text": "the end. Back in the old days, we would schedule\na code reading just as we were finishing a project\nand usually it would be canceled because we were\nlate. <i>I now believe that code reading should be\nhappening all the time throughout the life of the\nproject.</i>",
                        "id": 31
                    },
                    {
                        "name": "Almost done",
                        "text": "I've managed projects where we're up against a\ndeadline and we had people saying, <i>“Yeah. I'm\nalmost done,” and then you get the code, and\nthere's nothing there, or it's crap, or whatever, and\nthey're nowhere close to done.</i> In management,\nthose are the experiences you hate the most and I\nthink code reading is the best way of not getting\ntrapped like that.",
                        "id": 32
                    },
                    {
                        "name": "Plus plus",
                        "text": "through be the default was wrong—<i>they shouldn't\nhave done that. ++ has huge security problems—it\nencourages you to be way too tricky, to try to do too\nmuch in one line.</i> In that compulsion to do it in one\nline, you make code which is hard to understand\nand which is likely to lead to things like buffer\noverrun errors.",
                        "id": 33
                    },
                    {
                        "name": "Continue",
                        "text": "It makes certain kinds of complicated structures\neasier to write. <i>But I found that I can always\nimprove the structure if I can find a way to factor\nit out. So as part of my personal discipline. I don't\nuse continue ever.</i>",
                        "id": 34
                    },
                    {
                        "name": "Good code",
                        "text": "it's really difficult to write good code in a sloppy\nmanner. <i>By good code. I mean it's going to be\nreadable. At one level, it doesn't matter what it\ndoes to a machine if I can't figure out what it does</i>,\nso it might turn out that the code is amazing in\nterms of its efficiency, or its compactness, or some\nother metric which I don't care about.",
                        "id": 35
                    },
                    {
                        "name": "Second system",
                        "text": "The fallacy is that it's going to take that amount\nof time again, though there are counterexamples.\n<i>You've got the second-system problem where\npeople who've had some success are given a blank\nslate and allowed to do whatever they want.</i>\nGenerally, they will fail because they'll be too\nambitious, they won't understand the limits.",
                        "id": 36
                    },
                    {
                        "name": "Compatibility problems",
                        "text": "Those sort of specification errors are really, really\nhard. And we have them in the Ajax world. <i>Most\nof our problems in the Ajax world are due to the\ndifferences at the browser level. Doing the cross-\nbrowser stuff is much harder than it should be</i>\nbecause the Web is not specified well and because\nthe implementations are so variable.",
                        "id": 37
                    },
                    {
                        "name": "All in your head",
                        "text": "that I couldn't program anymore because I just\ncouldn't keep enough stuff in my head. <i>A lot\nof programming is you keep stuff in your head\nuntil you can get it written down and structured\nproperly.</i> And I just couldn't do it.",
                        "id": 38
                    },
                    {
                        "name": "Js refactoring",
                        "text": "<i>That's one of the things that I discovered I really\nlike about JavaScript. Refactoring in JavaScript, I \nfind, is really easy.</i> Whereas refactoring a deep\nclass hierarchy can be really, really painful.",
                        "id": 39
                    },
                    {
                        "name": "Soft objects",
                        "text": "I've become a really big fan of soft\nobjects. <i>In JavaScript, any object is whatever you\nsay it is. That's alarming to people who come at\nit from a classical perspective</i> because without a\nclass, then what have you got? It turns out you\njust have what you need, and that's really useful.",
                        "id": 40
                    },
                    {
                        "name": "Discipline",
                        "text": "good to be scared because it is scary and it is\nreal. It requires discipline</i>. <i>In most of the classical\nlanguages, the language is the thing imposing the\ndiscipline. In JavaScript you have to bring your\nown discipline</i>.",
                        "id": 41
                    },
                    {
                        "name": "Js as java",
                        "text": "<i>I understand why people are frustrated with the\nlanguage. If you try to write in JavaScript as\nthough it is Java, it'll keep biting you. I did this.</i>\nOne of the first things I did in the language was\nto figure out how to simulate something that\nlooked sort of like a Java class, but at the edges it\ndidn't work anything like it.",
                        "id": 42
                    },
                    {
                        "name": "Js tools",
                        "text": "In Javascript there is much less need of formal tools like you\nhave in other languages. <i>The browser just wants a\nsource file, and so you send it a source file, and the\ncompiler is built into the browser, so there's really\nnothing to do</i>. You don't have a linker. You don't\nhave a compiler. You don't have any of that stuff. It\njust all runs on the browser.",
                        "id": 43
                    },
                    {
                        "name": "Browser one thread",
                        "text": "<i>One of the things I like about the browser model is\nthat we only get one thread. Some people complain\nabout that—if you lock up that thread, then the\nbrowser's locked up</i>. So you just don't do that.\nThere are constantly calls for putting threads into\nJavaScript and so far we've resisted that. I'm really\nglad we have.",
                        "id": 44
                    },
                    {
                        "name": "Json",
                        "text": "When XML was proposed as a data-interchange\nformat, my first impression of that was, “<i>My god,\nthis is way, way, way too complicated. We don't\nneed all of this stuff just to move data back and\nforth</i>.” And so I proposed another way to do it, json, \nand it won.",
                        "id": 45
                    },
                    {
                        "name": "Hiring",
                        "text": "I'm looking for quality of presentation.\n<i>I want to see what he thinks is something he's\nproud of. I want to see evidence that in fact he is\nthe author of the thing that he's defending.</i> I find\nthat is much more effective than asking them to\nsolve puzzles or trivia questions. I see all that kind\nof stuff as useless.",
                        "id": 46
                    },
                    {
                        "name": "Generalists",
                        "text": "I tend not to look\nfor that kind of overspecialization unless I have a\nreally specific niche. <i>Generally, I prefer generalists.\nI want someone who's capable of learning any of\nthose APIs but isn't necessarily skilled in any one.</i>",
                        "id": 47
                    }
                ]
            },
            {
                "name": "Jamie Zawinski",
                "children": [
                    {
                        "name": "Cross platform releases",
                        "text": "welll port it later.” Which is what many other\nfailed companies have done. <i>If you're trying to\nship a cross-platform product, history really shows\nthat's how you don't do it. If you want it to\nreally be cross-platform, you have to do them\nsimultaneously.</i> The porting thing results in a\ncrappy product on the second platform.",
                        "id": 48
                    },
                    {
                        "name": "Multithreading in java",
                        "text": "where it was writing some big file. <i>We took really\ngood advantage of multithreading in Java, which\nwas less painful than I had expected it to be. It was\njust really pleasant to work on.</i> From the API we\nhad designed we saw all these directions it could\ngrow.",
                        "id": 49
                    },
                    {
                        "name": "Academic approach",
                        "text": "only display plain text. They were being extremely\nacademic about their project. They were trying to\napproach it from the DOM/DTD side of things. <i>“Oh,\nwell, what we need to do is add another abstraction\nlayer here and have a delegate for this delegate for\nthis delegate.\" And eventually a character will show\nup on the screen.</i>",
                        "id": 50
                    },
                    {
                        "name": "Ship the product",
                        "text": "Zawinski: Yeah. At the end of the day, ship the\nfucking thing! It's great to rewrite your code and\nmake it cleaner and by the third time it'll actually\nbe pretty. <i>But that's not the point — you're not here\nto write code; you're here to ship products.<i>",
                        "id": 51
                    },
                    {
                        "name": "Competitor crap code",
                        "text": "<i>Your competitor's six-month 1.0 has crap code and\nthey're going to have to rewrite it in two years but,\nguess what:</i> they can rewrite it because you don't\nhave ajob anymore.",
                        "id": 52
                    },
                    {
                        "name": "Inherit code rewrite",
                        "text": "you have to cut your losses. And this always feels\nwrong to me, <i>but when you inherit code from\nsomeone else, sometimes it's faster to write your\nown than to reuse theirs.</i> Because it's going to take\na certain amount of time to understand their code\nand learn how to use it.",
                        "id": 53
                    },
                    {
                        "name": "One file version",
                        "text": "<i>When I'm just writing the first version of the\nprogram. I tend to put everything in one file.\nAnd then I start seeing structure in that file.</i>\nLike there's this block of things that are pretty\nsimilar. That's a thousand lines now, so why don't\nI move that into another file. And the API sort of\nbuilds up organically that way.",
                        "id": 54
                    },
                    {
                        "name": "Quick use",
                        "text": "I think one of the most important things, for\nme anyway, <i>when building something from the\nground up like that is, as quickly as possible,\ngetting the program to a state that you, the\nprogrammer, can use it. Even a little bit.</i> Because\nthat tells you where to go next in a really visceral\nway.",
                        "id": 55
                    },
                    {
                        "name": "Error messages",
                        "text": "<i>A lot of programmers have the instinct of, “You've\ngot to present the error message!” No you don't.\nNo one cares about that.</i> That sort of stuff is\na lot easier to manage in languages like Java\nthat actually have an exception system. Where,\nat the top loop of your idle state, you just catch\neverything and you're done.",
                        "id": 56
                    },
                    {
                        "name": "More comments",
                        "text": "<i>I always wish people would comment more,\nthough the thing that makes me cringe is when the\ncomment is the name of the function rephrased.</i>\nFunction's called push_stack and the comment\nsays, “This pushes to the stack.” Thank you.",
                        "id": 57
                    },
                    {
                        "name": "Ability to argue",
                        "text": "<i>Certainly with the folks I've worked with,\nability to argue their point was important because\nwe all ended up being a pretty argumentative\nbunch</i>. With that environment, that helped a lot.\nThat certainly doesn't have anything to do with\nprogramming ability.",
                        "id": 58
                    },
                    {
                        "name": "Ignorance fear",
                        "text": "Asking questions. I think one thing that's really\nimportant is to not be afraid of your ignorance. <i>If\nyou don't understand how something works, ask\nsomeone who does. A lot of people are skittish\nabout that. And that doesn't help anybody.</i> Not\nknowing something doesn't mean you're dumb—it\njust means you don't know it yet.",
                        "id": 59
                    },
                    {
                        "name": "Design patterns book",
                        "text": "Then there was <i>another book that everybody\nthought was the greatest thing ever in that same\nperiod—Design Patterns—which I just thought was\ncrap.</i> It was just like, programming via cut and\npaste. Rather than thinking through your task\nyou looked through the recipe book and found\nsomething that maybe, kinda, sorta felt like it, and\nthen just aped it. That's not programming.",
                        "id": 60
                    },
                    {
                        "name": "Books terminology",
                        "text": "Then in meetings they'd be tossing around\nall this terminology they got out of that book.\n<i>Like, the inverse, reverse, double-back-flip pattern\n—whatever. Oh, you mean a loop? OK.</i>",
                        "id": 61
                    },
                    {
                        "name": "Under the hood",
                        "text": "Zawinski: Well, curiosity—taking things apart.\n<i>Wanting to know what's going on under the hood.\nI think that's really the basis of it. Without that I\ndon't think you get very far. That's your primary\nway of acquiring knowledge.</i> Taking something\napart and looking at it is how you learn to build\nyour own. At least for me. I've read very few books",
                        "id": 62
                    }
                ]
            }
        ]
    },
    {
        "name": "Passionate Programmer",
        "children": [
            {
                "name": "Chad Fowler",
                "children": [
                    {
                        "name": "Low expectations",
                        "text": "<i>Most of us are content to go with the\nflow. Our expectations have been lowered for us\nby the media and by our friends, acquaintances,\nand family members</i>. So, leading a remarkable life\nis something you have to discover as even being a\nreasonable goal. It’s not obvious.",
                        "id": 63
                    },
                    {
                        "name": "Loving your work",
                        "text": "<i>If your life is primarily consumed by your work,\nthen loving your work is one of the most\nimportant keys to loving your life.</i> Challenging,\nmotivating, rewarding work is more likely to make\nyou want to get up in the morning than dull,\naverage tasks. Doing your job well means that the\nactivity you do for 50 percent of your available\ntime is something you're good at.",
                        "id": 64
                    },
                    {
                        "name": "Higher salary",
                        "text": "A higher salary might\nactually be desirable and lead toward happiness.</i>\n<i>But if you take your eyes off the primary goal,\nyou can find yourself driving toward a higher\nsalary at the expense of your happiness.</i> It sounds\nridiculous, but I’ve done it. And so have you.",
                        "id": 65
                    },
                    {
                        "name": "Business purpose",
                        "text": "<i>As software developers, we are\nbusinesspeople. Our companies don’t employ us\nbecause they love us.</i> They never have, and they\nnever will. That’s not the job of a business.\nBusinesses don’t exist so we can have a place to go\nevery day.",
                        "id": 66
                    },
                    {
                        "name": "Old systems",
                        "text": "<i>In those stages, the old systems have to talk to the new systems.\nSomeone has to know how to make the new speak\nto the old, and vice versa.</i> Typically, the young\ntykes don’t know (or want to know) how to make\nthe old systems listen.",
                        "id": 67
                    },
                    {
                        "name": "Business language",
                        "text": "<i>You might be “just a programmer,” but being able\nto speak to your business clients in the language\nof their business domain is a critical skill.</i> Imagine\nhow much easier life would be if everyone you\nhad to work with really understood how software\ndevelopment works.",
                        "id": 68
                    },
                    {
                        "name": "Candidate pool",
                        "text": "<i>The addition of Smalltalk to the requirements list\nyielded a candidate pool that was tiny in contrast\nto our previous list.</i> These people were diamonds\nin the rough. They really understood object-oriented programming.",
                        "id": 69
                    },
                    {
                        "name": "Take opportunity",
                        "text": "It drives me crazy to ask people whether\nthey've seen or used certain not-quite-mainstream\ntechnologies only to hear, <i>“I haven't been given the\nopportunity to work on that” in return. Given the\nopportunity? Neither was I! I took the opportunity\nto learn.</i>",
                        "id": 70
                    },
                    {
                        "name": "Unix guy",
                        "text": "<i>Another artificial (and inexcusable) line gets\ndrawn around platforms or operating systems.</i>\nBeing a UNIX Guy who refuses to do Windows\nis increasingly more impractical.",
                        "id": 71
                    },
                    {
                        "name": "Developer environment",
                        "text": "<i>It’s rare, and refreshing,\nto find a developer who truly understands\nthe platform on which he or she is working.</i>\nApplications are better and work gets done faster\nas aresult.",
                        "id": 72
                    },
                    {
                        "name": "Rate himself",
                        "text": "I asked this person (and all the\nothers I had interviewed that week) to rate himself\nona scale of one to ten. He said nine. I’m expecting\na star here. <i>If this guy rates himself so high, why\ncan’t he think of a single abusive programming\ntrick that would cause a JVM to crash?</i>",
                        "id": 73
                    },
                    {
                        "name": "Specializing in something",
                        "text": "<i>Too many of us seem to believe that specializing\nin something simply means you don’t know about\nother things.</i> I could, for example, call my mother\na Windows specialist, because she has never used \nLinux.",
                        "id": 74
                    },
                    {
                        "name": "Changing computer industry",
                        "text": "This is the kind of specialist who will survive\nin the changing computer industry. If you're\na .NET specialist, it’s not just an excuse for not\nknowing anything except .NET. <i>It means that if\nit has to do with .NET, you are the authority. IIS\nservers hanging and needing to be rebooted? “No\nproblem.” Source control integration with Visual\nStudio .NET? “I’ll show you how.”</i>",
                        "id": 75
                    },
                    {
                        "name": "Impostor syndrome",
                        "text": "<i>When I showed up on the job. I was paranoid\nI would be discovered as the charlatan I really\nwas. What is this saxophone player doing here with\nus trained professionals?</i> After all. I was working\nwith people who had advanced computer science\ndegrees. And, here I was with only part of a music\ndegree trying to fit in as if I knew something.",
                        "id": 76
                    },
                    {
                        "name": "Master degree notes",
                        "text": "Within a few days of work, the truth started to\nsink in. <i>These people don’t know what the hell they’ve\ndoing! In fact, some people were watching me work\nand taking notes!</i> People with master’s degrees in\ncomputer science!",
                        "id": 77
                    }
                ]
            }
        ]
    },
    {
        "name": "Show your work",
        "children": [
            {
                "name": "Austin Kleon",
                "children": [
                    {
                        "name": "Self promotion",
                        "text": "I hate talking about self-promotion. Comedian\nSteve Martin famously dodges these questions\nwith the advice, <i>“Be so good they can’t ignore you.”\nIf you just focus on getting really good. Martin\nsays, people will come to you.</i> I happen to agree.",
                        "id": 78
                    },
                    {
                        "name": "Findable",
                        "text": "You don’t really find an audience for your work;\nthey find you. <i>But it’s not enough to be good. In\norder to be found, you have to be findable.</i> I think\nthere’s an easy way of putting your work out there\nand making it discoverable while you're focused on\ngetting really good.",
                        "id": 79
                    },
                    {
                        "name": "Sharing routine",
                        "text": "<i>Almost all of the people I look up to and try to steal\nfrom today, regardless of their profession, have\nbuilt sharing into their routine.</i> These people aren’t\nschmoozing at cocktail parties; they’re too busy\nfor that. They’re cranking away in their studios,",
                        "id": 80
                    },
                    {
                        "name": "No resume",
                        "text": "<i>Imagine if your next boss didn’t have to read\nyour résumé because he already reads your blog.</i>\nImagine being a student and getting your first\ngig based on a school project you posted online.",
                        "id": 81
                    },
                    {
                        "name": "Support",
                        "text": "Imagine losing your job but having a social\nnetwork of people familiar with your work and\nready to help you find a new one. <i>Imagine turning\na side project or a hobby into your profession\nbecause you had a following that could support you.</i>",
                        "id": 82
                    },
                    {
                        "name": "Amateurs",
                        "text": "<i>We're all terrified of being revealed as amateurs, \nbut in fact, today it is the amateur—the enthusiast\nwho pursues her work in the spirit of love</i>, regardless of the\npotential for fame, money, or career—who often\nhas the advantage over the professional.",
                        "id": 83
                    },
                    {
                        "name": "Doing nothing",
                        "text": "creative work, the difference between the mediocre\nand the good is vast. <i>Mediocrity is, however, still\non the spectrum; you can move from mediocre\nto good in increments. The real gap is between\ndoing nothing and doing something</i>.” Amateurs\nknow that contributing something</i> is better than\ncontributing nothing.",
                        "id": 84
                    },
                    {
                        "name": "Lifelong learners",
                        "text": "<i>Amateurs might lack formal training, but\nthey’re all lifelong learners, and they make a\npoint of learning in the open</i>, so that others\ncan learn from their failures and successes.",
                        "id": 85
                    },
                    {
                        "name": "Amateur help",
                        "text": "Sometimes, amateurs have more to teach\nus than experts. <i>“It often happens that two\nschoolboys can solve difficulties in their\nwork for one another better than the master\ncan,”</i> wrote author C. S. Lewis.",
                        "id": 86
                    },
                    {
                        "name": "Fellow pupil",
                        "text": "<i>The fellow-pupil can help more than the master because\nhe knows less. The difficulty we want him\nto explain is one he has recently met.</i> The\nexpert met it so long ago he has forgotten.”\nWatching amateurs at work can also inspire\nus to attempt the work ourselves.",
                        "id": 87
                    },
                    {
                        "name": "Changing rate",
                        "text": "<i>The world is changing at such a rapid\nrate that it’s turning us all into amateurs.</i>\nEven for professionals, the best way to\nflourish is to retain an amateur’s spirit\nand embrace uncertainty and the unknown.",
                        "id": 88
                    },
                    {
                        "name": "Use your voice",
                        "text": "We're always being told find your voice. <i>When\nI was younger. I never really knew what this\nmeant. I used to worry a lot about voice,\nwondering if I had my own. But now I realize\nthat the only way to find your voice is to use\nit.</i> It’s hardwired, built into you. Talk about\nthe things you love. Your voice will follow.",
                        "id": 89
                    },
                    {
                        "name": "Not all artists",
                        "text": "Now, let’s face it: We’re not all artists or\nastronauts. A lot of us go about our work\nand feel like we have nothing to show for\nit at the end of the day.<i> But whatever the\nnature of your work, there is an art to what\nyou do, and there are people who would be\ninterested in that art.</i>",
                        "id": 90
                    },
                    {
                        "name": "Make stuff",
                        "text": "other people can see. <i>“You have to make\nstuff,” said journalist David Carr when he\nwas asked if he had any advice for students.\n“No one is going to give a damn about your\nrésumé;</i> they want to see what you have\nmade with your own little fingers.”",
                        "id": 91
                    },
                    {
                        "name": "Documenting",
                        "text": "<i>Whether you share it or not, documenting and\nrecording your process as you go along has its own\nrewards:</i> You'll start to see the work you're doing\nmore clearly and feel like you’re making progress.\nAnd when you're ready to share, you'll have a\nsurplus of material to choose from.",
                        "id": 92
                    },
                    {
                        "name": "90 crap",
                        "text": "Don’t worry about everything you post being perfect. \n<i>Science fiction writer Theodore Sturgeon once said \nthat 90 percent of everything is crap. The same is true \nof our own work.</i> The trouble is, we don’t always know \nwhat’s good and what sucks. That’s why it’s important \nto get things in front of others and see how they react.",
                        "id": 93
                    },
                    {
                        "name": "Next day",
                        "text": "Don’t overthink it; just go with your gut.\nIf you’re unsure about whether to share\nsomething, let it sit for 24 hours. Put it in a\ndrawer and walk out the door. <i>The next day,\ntake it out and look at it with fresh eyes. Ask\nyourself, “Is this helpful? Is it entertaining?\nIs it something I'd be comfortable with my\nboss or my mother seeing?”</i>",
                        "id": 94
                    },
                    {
                        "name": "Stock and flow",
                        "text": "“Stock and flow” is an economic concept\nthat writer Robin Sloan has adapted into a\nmetaphor for media: “<i>Flow is the feed. It’s the\nposts and the tweets. It’s the stream of daily\nand sub-daily updates that remind people\nyou exist. Stock is the durable stuff.</i> It’s the\ncontent you produce that’s as interesting in\ntwo months (or two years) as it is today. It’s\nwhat people discover via search.",
                        "id": 95
                    },
                    {
                        "name": "Invention machine",
                        "text": "<i>Don’t think of your website as a self-promotion machine,\nthink of it as a self-invention machine.</i> Online, \nyou can become the person you really want to be. Fill your website \nwith your work and your ideas and the stuff you care about.",
                        "id": 96
                    },
                    {
                        "name": "Loving your garbage",
                        "text": "<i>We all love things that other people think are\ngarbage. You have to have the courage to keep\nloving your garbage, because what makes us\nunique is the diversity and breath of our\ninfluences</i>, the unique ways in which we mix\nup the parts of culture others have deemed\n“high” and the “low.”",
                        "id": 97
                    },
                    {
                        "name": "Proper credit",
                        "text": "Crediting work in our copy-and-paste age of reblogs and retweets can\nseem like a futile effort, but it’s worth it, and\nit’s the right thing to do. <i>You should always\nshare the work of others as if it were your\nown, treating it with respect and care.</i>",
                        "id": 98
                    },
                    {
                        "name": "About stories",
                        "text": "John Gardner said the basic plot of nearly all\nstories is this: <i>“A character wants something,\ngoes after it despite opposition (perhaps\nincluding his own doubts), and so arrives at\na win, lose, or draw.”</i> I like Gardner's plot\nformula because it’s also the shape of most\ncreative work.",
                        "id": 99
                    },
                    {
                        "name": "Nonfiction",
                        "text": "<i>Just because you're trying to tell a good\nstory about yourself doesn’t mean you're\ninventing fiction. Stick to nonfiction.</i> Tell the\ntruth and tell it with dignity and self-respect.\nIf you're a student, say you're a student. If\nyou work a day job, say you work a day.",
                        "id": 100
                    },
                    {
                        "name": "Something disgraceful",
                        "text": "Maybe you're in the wrong line of work,\nor maybe you're not doing the work you're\nsupposed to be doing. \n<i>Remember what the author George Orwell\nwrote: “Autobiography is only to be trusted\nwhen it reveals something disgraceful.”</i>",
                        "id": 101
                    },
                    {
                        "name": "Human spam",
                        "text": "<i>I call these people human spam. They’re\neverywhere, and they exist in every\nprofession.</i> They don’t want to pay their\ndues, they want their piece right here, right\nnow. They don’t want to listen to your ideas.",
                        "id": 102
                    },
                    {
                        "name": "Good citizen",
                        "text": "If you want fans, you have to be a fan first.\n<i>If you want to be accepted by a community,\nyou have to first be a good citizen of that\ncommunity.</i> If you’re only pointing to your\nown stuff online, you're doing it wrong.",
                        "id": 103
                    },
                    {
                        "name": "Real peers",
                        "text": "These are your real peers - <i>the people who\nshare your obsessions, the people who share\na similar mission to your own, the people\nwith whom you share a mutual respect.</i>\nThere will only be a handful or so of them,\nbut they’re so, so important.",
                        "id": 104
                    },
                    {
                        "name": "Criticism",
                        "text": "Designer Mike Monteiro says that the most\nvaluable skill he picked up in art school was\nlearning how to take a punch. <i>He and his\nfellow classmates were absolutely brutal during\ncritiques. “We were basically trying to see if we\ncould get each other to drop out of school.”</i> Those\nvicious critiques taught him not to take criticism\npersonally.",
                        "id": 105
                    },
                    {
                        "name": "Fear imagination",
                        "text": "The trouble with imaginative people is that we’re good at picturing\nthe worst that could happen to us. Fear is often just the imagination taking a wrong\nturn. <i>Bad criticism is not the end of the world. As far as I know, no one has ever\ndied from a bad review.</i> Take a deep breath and accept whatever comes.",
                        "id": 106
                    },
                    {
                        "name": "Hated work",
                        "text": "You can’t control what sort of criticism you receive, \nbut you can control how you react to it. \n<i>Sometimes when people hate something about your work, it’s fun\nto push that element even further. To make something they’d hate even more.</i>\nHaving your work hated by certain people is a badge of honor.",
                        "id": 107
                    },
                    {
                        "name": "Keep your balance",
                        "text": "You have to remember\nthat your work is something you do, not who\nyou are. This is especially hard for artists\nto accept, as so much of what they do is\npersonal. <i>Keep close to your family, friends,\nand the people who love you for you, not just\nthe work.</i>",
                        "id": 108
                    },
                    {
                        "name": "Troll",
                        "text": "<i>A troll is a person who isn’t interested in\nimproving your work, only provoking you\nwith hateful, aggressive, or upsetting talk.</i>\nYou will gain nothing by engaging with these\npeople. Don’t feed them, and they'll usually\ngo away.",
                        "id": 109
                    },
                    {
                        "name": "Nasty comments",
                        "text": "Do you have a troll problem? Use the block\nbutton on social media sites. <i>Delete nasty\ncomments. My wife is fond of saying, “If\nsomeone took a dump in your living room,\nyou wouldn't let it sit there, would you?”</i>\nNasty comments are the same-they should\nbe scooped up and thrown in the trash.",
                        "id": 110
                    }
                ]
            }
        ]
    },
    {
        "name": "Steal Like an Artist",
        "children": [
            {
                "name": "Austin Kleon",
                "children": [
                    {
                        "name": "People advice",
                        "text": "It’s one of my theories that <i>when people\ngive you advice, they’re really just\ntalking to themselves in the past. \nThis book is me talking to a previous\nversion of myself.</i>",
                        "id": 111
                    },
                    {
                        "name": "Unknown reference",
                        "text": "The writer Jonathan Lethem has said that when\n<i>people call something “original,” nine out of ten\ntimes they just don’t know the references</i> or the\noriginal sources involved.",
                        "id": 112
                    },
                    {
                        "name": "No one listening",
                        "text": "Some people find this idea depressing, but it\nfills me with hope. As the French writer André\nGide put it, <i>“Everything that needs to be said has\nalready been said. But, since no one was listening,\neverything must be said again.”</i>",
                        "id": 113
                    },
                    {
                        "name": "Friendly ghosts",
                        "text": "<i>Seeing yourself as part of a creative lineage will\nhelp you feel less alone as you start making your\nown stuff</i>. I hang pictures of my favorite artists\nin my studio. They’re like friendly ghosts. I can\nalmost feel them pushing me forward as I’m\nhunched over my desk.",
                        "id": 114
                    },
                    {
                        "name": "Remote masters",
                        "text": "<i>The great thing about dead or remote masters is\nthat they can’t refuse you as an apprentice.</i> You\ncan learn whatever you want from them. They left\ntheir lesson plans in their work.",
                        "id": 115
                    },
                    {
                        "name": "Get your education",
                        "text": "School is one thing. Education is another. The two\ndon’t always overlap. <i>Whether you're in school\nor not, it’s always your job to get yourself an\neducation.</i>",
                        "id": 116
                    },
                    {
                        "name": "Go deeper",
                        "text": "You have to be curious about the world in which\nyou live. Look things up. <i>Chase down every\nreference. Go deeper than anybody else—that’s\nhow you'll get ahead.</i>",
                        "id": 117
                    },
                    {
                        "name": "Google everything",
                        "text": "Google everything. I mean everything.\nGoogle your dreams. Google your problems.\n<i>Don’t ask a question before you Google it.\nYou'll either find the answer or you'll come\nup with a better question.</i>",
                        "id": 118
                    },
                    {
                        "name": "Start book",
                        "text": "Always be reading. Go to the library. <i>There’s\nmagic in being surrounded by books. Get lost\nin the stacks. Read bibliographies. It’s not the\nbook you start with, it’s the book that book\nleads you to.</i>",
                        "id": 119
                    },
                    {
                        "name": "Unread books",
                        "text": "Collect books, even if you don’t plan on reading\nthem right away. <i>Filmmaker John Waters has said,\n“Nothing is more important than an unread library.”</i>",
                        "id": 120
                    },
                    {
                        "name": "Impostor syndrome",
                        "text": "About impostore syndrome. <i>The clinical definition is a “psychological\nphenomenon in which people are unable to\ninternalize their accomplishments</i>.” It means that\nyou feel like a phony, like you're just winging it,\nthat you really don’t have any idea what you're\ndoing.",
                        "id": 121
                    },
                    {
                        "name": "Not plagiarism",
                        "text": "We're talking about practice here, not plagiarism.\n<i>Plagiarism is trying to pass someone else’s\nwork off as your own. Copying is about reverse-\nengineering.</i>  It’s like a mechanic taking apart a car\n‘to see how it works.",
                        "id": 122
                    },
                    {
                        "name": "Research",
                        "text": "the people you want to be. The songwriter Nick\nLowe says, “You start out by rewriting your hero’s\ncatalog.” And you don’t just steal from one of your\nheroes, you steal from all of them. <i>The writer\nWilson Mizner said if you copy from one author,\nit’s plagiarism, but if you copy from many, it’s\nresearch</i>.",
                        "id": 123
                    },
                    {
                        "name": "Emulation",
                        "text": "At some point, you'll have to move from\nimitating your heroes to emulating them.\n<i>Imitation is about copying. Emulation\nis when imitation goes one step further,\nbreaking through into your own thing.</i>",
                        "id": 124
                    },
                    {
                        "name": "Adapt the moves",
                        "text": "“There isn’t a move that’s a new move.” <i>The\nbasketball star Kobe Bryant has admitted that\nall of his moves on the court were stolen from\nwatching tapes of his heroes.</i> He realized he\ncouldn’t completely pull them off because he\ndidn’t have the same body type as the guys he was\nthieving from. He had to adapt to make them his own.",
                        "id": 125
                    },
                    {
                        "name": "Adding something",
                        "text": "In the end, <i>merely imitating your heroes is not\nflattering them. Transforming their work into\nsomething of your own is how you flatter them.</i>\nAdding something to the world that only you can\nadd.",
                        "id": 126
                    },
                    {
                        "name": "Make stuff",
                        "text": "The manifesto is this: <i>Draw the art you want to\nsee, start the business you want to run, play the\nmusic you want to hear, write the books you want\nto read, build the products you want to use</i>—do\nthe work you want to see done.",
                        "id": 127
                    },
                    {
                        "name": "Body work",
                        "text": "Work that only comes from the head isn’t any\ngood. Watch a great musician play a show. Watch\na great leader give a speech. You'll see what I mean.\n<i>You need to find a way to bring your body into\nyour work. Our nerves aren’t a one-way street.\n—our bodies</i> can tell our brains as much as our\nbrains tell our bodies</i>.",
                        "id": 128
                    },
                    {
                        "name": "Side projects",
                        "text": "One thing I’ve learned in my brief career: <i>It’s the\nside projects that really take off. By side projects I\nmean the stuff that you thought was just messing\naround.</i> Stuff that’s just play. That’s actually the\ngood stuff. That’s when the magic happens.",
                        "id": 129
                    },
                    {
                        "name": "Lot of projects",
                        "text": "<i>I think it’s good to have a lot of projects going\nat once so you can bounce between them.</i>\nWhen you get sick of one project, move over to\nanother, and when you're sick of that one, move\nback to the project you left. ",
                        "id": 130
                    },
                    {
                        "name": "Get bored",
                        "text": "<i>Creative people need time to just sit around\nand do nothing. I get some of my best ideas when\nI’m bored</i>, which is why I never take my shirts\nto the cleaners. I love ironing my shirts—it’s so\nboring. I almost always get good ideas.",
                        "id": 131
                    },
                    {
                        "name": "Avoiding work",
                        "text": "I almost always get good ideas. <i>If you’re out\nof ideas, wash the dishes. Take a really long walk.\nStare at a spot on the wall for as long as you can.</i> As\nthe artist Maira Kalman says, “Avoiding work is the\nway to focus my mind.”",
                        "id": 132
                    },
                    {
                        "name": "Hobby",
                        "text": "<i>It’s so important to have a hobby. A hobby is\nsomething creative that’s just for you.</i> You\ndon’t try to make money or get famous off\nit, you just do it because it makes you happy.\nAhobby is something that gives but doesn’t\ntake.",
                        "id": 133
                    },
                    {
                        "name": "Public image",
                        "text": "This is actually a good thing, because you want\nattention only after you're doing really good work.\n<i>There’s no pressure when you're unknown. You\ncan do what you want. Experiment. Do things just\nfor the fun of it.</i> When you’re unknown, there’s\nnothing to distract you from getting better. No\npublic image to manage.",
                        "id": 134
                    },
                    {
                        "name": "Stuff on internet",
                        "text": "It’s a two-step process. <i>Step one, “do good work,” is\nincredibly hard. There are no shortcuts. Make stuff every\nday. Know you're going to suck for a while. Fail. Get better.</i>\nStep two, “share it with people,” was really hard up until\nabout ten years ago or so. Now, it's very simple: “Put your\nstuff on the Internet.”",
                        "id": 135
                    },
                    {
                        "name": "Ideas incubator",
                        "text": "<i>You don’t put yourself online only because you\nhave something to say—you can put yourself\nonline to find something to say.</i> The Internet can\nbe more than just a resting place to publish your\nfinished ideas—it can also be an incubator for\nideas that aren't fully formed.",
                        "id": 136
                    },
                    {
                        "name": "Travel",
                        "text": "<i>Your brain gets too comfortable in your everyday\nsurroundings. You need to make it uncomfortable.\nYou need to spend some time in another land,</i>\namong people that do things differently than you.\nTravel makes the world look new, and when the\nworld looks new, our brains work harder.",
                        "id": 137
                    },
                    {
                        "name": "Another room",
                        "text": "Harold Ramis, once laid out his rule for\nsuccess: “Find the most talented person in the\nroom, and if it’s not you, go stand next to him.\"\n<i>If you ever find that you're the most talented\nperson in the room, you need to find another room.</i>",
                        "id": 138
                    },
                    {
                        "name": "Anger",
                        "text": "Anger is one of my favorite creative resources.\nSome mornings, when I can’t wake up. I lie in bed\nand read e-mail and Twitter until my blood\nstarts boiling and I get fired up enough to spring\nout of bed. <i>But instead of wasting my anger on\ncomplaining or lashing out at people. I try to\nchannel it into my writing and my drawing.</i>",
                        "id": 139
                    },
                    {
                        "name": "To busy doing",
                        "text": "Not everybody will get it. People will misinterpret\nyou and what you do. They might even call\nyou names. <i>So get comfortable with being\nmisunderstood, disparaged, or ignored—the trick\nis to be too busy doing your work to care.</i>",
                        "id": 140
                    },
                    {
                        "name": "Validation boost",
                        "text": "Life is a lonely business, often filled with\ndiscouragement and rejection. <i>Yes, validation is\nfor parking, but it’s still a tremendous boost when\npeople say nice things about our work.</i>",
                        "id": 141
                    }
                ]
            }
        ]
    },
    {
        "name": "The Modern Javascript",
        "children": [
            {
                "name": "Ilya Kantor",
                "children": [
                    {
                        "name": "Live script",
                        "text": "<i>When JavaScript was created, it initially had another name: “LiveScript”.</i> \nBut Java was very popular at that time, so it was decided that positioning \na new language as a “younger brother” of Java would help.",
                        "id": 142
                    },
                    {
                        "name": "Js engine",
                        "text": "<i>Today, JavaScript can execute not only in the browser, \nbut also on the server, or actually on any device \nthat has a special program called the JavaScript engine.</i> \nThe browser has an embedded engine sometimes called a JavaScript virtual machine.",
                        "id": 143
                    },
                    {
                        "name": "Machine language",
                        "text": "<i>Engines are complicated. But the basics are easy.\nThe engine parses the script then it compiles to the machine language.</i>\nThe engine applies optimizations and runs the code.",
                        "id": 144
                    },
                    {
                        "name": "Safe language",
                        "text": "<i>Modern JavaScript is a safe programming language. \nIt does not provide low-level access to memory or CPU,</i> \nbecause it was initially created for browsers</i> which do not require it.",
                        "id": 145
                    },
                    {
                        "name": "Environment",
                        "text": "<i>JavaScript’s capabilities greatly depend on the environment it’s running in.</i>\nFor instance, Node.js supports functions that allow JavaScript to read/write arbitrary files, \nperform network requests, etc.",
                        "id": 146
                    },
                    {
                        "name": "In browser js",
                        "text": "<i>In-browser JavaScript can do everything related to webpage manipulation,</i> \ninteraction with the user, add new HTML to the page, change the existing content, modify styles.",
                        "id": 147
                    },
                    {
                        "name": "Unique",
                        "text": "<i>What makes JavaScript unique?\nIt has full integration with HTML/CSS, \nit is supported by all major browsers and it is enabled by default.</i>\nThat’s why it’s the most widespread tool for creating browser interfaces.",
                        "id": 148
                    },
                    {
                        "name": "Use strict",
                        "text": "For a long time, JavaScript evolved without compatibility issues. \nNew features were added to the language while old functionality didn’t change.\n<i>That had the benefit of never breaking existing code. \nBut the downside was that any mistake or an imperfect decision \nmade by JavaScript’s creators got stuck in the language forever.</i>",
                        "id": 149
                    },
                    {
                        "name": "Null",
                        "text": "<i>In Javascript the result of typeof null is object. That’s an officially \nrecognized error in typeof, coming from very early days \nof JavaScript and kept for compatibility.</i> It is not a reference to a \nnon-existing object or a null pointer like in some other languages. \nIt’s just a special type which represents nothing.",
                        "id": 150
                    },
                    {
                        "name": "Ninja short",
                        "text": "<i>Brevity is the soul of wit.\nMake the code as short as possible. \nShow how smart you are. If you write like that, \na developer who tries to understand is going to have a merry time.</i> \nThen come to you, seeking for an answer. Tell them \nthat shorter is always better. Initiate them into the paths of ninja.\n(ninja code :)",
                        "id": 151
                    },
                    {
                        "name": "Ninja one letter",
                        "text": "<i>A short variable disappears in the code like \na real ninja in the forest. No one will be able \nto find it using “search” of the editor.</i> \nAnd even if someone does, they won’t be able \nto “decipher” what the name a or b means. \n(ninja code :)",
                        "id": 152
                    },
                    {
                        "name": "Ninja abbreviations",
                        "text": "<i>If the team rules forbid the use of one-letter \nand vague names - shorten them, make abbreviations.\nOnly the one with truly good intuition will be able \nto understand such names.</i> Try to shorten everything. \nOnly a worthy person should be able to uphold the development of your code. \n(ninja code :)",
                        "id": 153
                    },
                    {
                        "name": "Ninja names",
                        "text": "<i>While choosing a name try to use the most abstract word. \nLike obj, data, value, item, elem and so on.</i>\nThe ideal name for a variable is data. Use it everywhere you can. \n(ninja code :)",
                        "id": 154
                    },
                    {
                        "name": "Ninja synonyms",
                        "text": "<i>Using similar names for same things makes \nlife more interesting and shows your creativity to the public.</i>\nInsinuate that there’s a subtle difference between \nsuch functions, while there is none. For two functions \nwith important differences - use the same prefix! \n(ninja code :)",
                        "id": 155
                    },
                    {
                        "name": "Ninja reuse",
                        "text": "<i>Add a new variable only when absolutely necessary.\nInstead, reuse existing names. Just write new values \ninto them.</i> The purpose is to develop the intuition \nand memory of a person reading the code. \n(ninja code :)",
                        "id": 156
                    },
                    {
                        "name": "Ninja underscores",
                        "text": "<i>Put underscores _ and __ before variable names. \nIt would be great if only you knew their meaning.</i>\nA smart ninja puts underscores at one spot of code \nand evades them at other places. That makes the code \neven more fragile and increases the probability of future errors. \n(ninja code :)",
                        "id": 157
                    }
                ]
            }
        ]
    }
]