[
    {
        "name": "Coders at work",
        "children": [
            {
                "name": "Brad Fitzpatrick",
                "children": [
                    {
                        "name": "Maintainer for life",
                        "text": "<i>I've also done a lot of testing since LiveJournal.\nOnce I started working with other people\nespecially. And once I realized that code I write\nnever fucking goes away and I'm going to be a\nmaintainer for life.</i> I get comments about blog\nposts that are almost 10 years old. “Hey. I found\nthis code. I found a bug,” and I'm suddenly\nmaintaining code.",
                        "page": "01",
                        "id": 1
                    },
                    {
                        "name": "Tests to guard",
                        "text": "<i>I had to force a lot of people to write tests, \nmostly people who were working for me. \nI would write tests to guard against my own code breaking, \nand then once they wrote code. I was like, “Are you even sure that\nworks? Write a test. Prove it to me.”</i> At a certain\npoint, people realize, “Holy crap, it does pay off,”\nespecially maintenance costs later.",
                        "page": "02",
                        "id": 2
                    },
                    {
                        "name": "About memcached",
                        "text": "<i>I remember coming up with the idea. \nI was in my shower one day. The site\nwas melting down and I was showering and then\nI realized we had all this free memory all over the\nplace.</i> I whipped up a prototype that night, wrote\nthe server in Perl and the client in Perl.",
                        "page": "03",
                        "id": 3
                    },
                    {
                        "name": "Win a race",
                        "text": "It’s about being awesome. It’s about winning. \n<i>You don’t win a race by trying not to lose. \nAnd you don’t win at life by trying not to suck</i>. \nFortunately, the content of\nthe book has never been about trying not to suck. \nI can’t think that way, and neither should you.",
                        "page": "04",
                        "id": 4
                    },
                    {
                        "name": "Write something complex",
                        "text": "Oh, yeah. I definitely try to find an\nexcuse to use anything, to learn it. <i>Because you\nnever learn something until you have to write\nsomething in it, until you have to live and breathe\nit.</i> It's one thing to go learn a language for fun, but\nuntil you write some big, complex system in it, you\ndon't really learn it.",
                        "page": "04",
                        "id": 5
                    },
                    {
                        "name": "Formal education",
                        "text": "I knew programming pretty well but I didn't have \nthe vocabulary to describe what it was I was doing. \n<i>Or I would make up my own terminology for it \nand people would think I didn't know what I was talking about.\nFormal C.S. education helped me be able to talk about it.</i>",
                        "page": "05",
                        "id": 6
                    },
                    {
                        "name": "Hard parts first",
                        "text": "Sometimes. But I've started with the\nhard bits or the parts I was unsure of, and tried\nto implement those parts first. <i>I try not to put\noff anything hard or surprising to the end; I enjoy\ndoing the hard things first.</i> The projects that I\nnever finish—my friends give me shit that it's a\nwhole bunch—it's because I did the hard part.",
                        "page": "06",
                        "id": 7
                    },
                    {
                        "name": "Reading code",
                        "text": "Then I really enjoyed reading code, because\nwhenever I didn't understand some pattern. I was\nlike, <i>“Wait, why the fuck did they do it like this?”\nand I would look around more, and I'd be like,\n“Wow, that is a really clever way to do this. I see\nhow that pays off.”</i> I would've done that earlier but\nI was afraid to do it because I was thinking that if it\n‘wasn't my code. I wouldn't understand it.",
                        "page": "07",
                        "id": 8
                    },
                    {
                        "name": "Strict style guide",
                        "text": "Having worked at Google with really strict style\nguidelines in all languages. <i>On our top six or seven\nlanguages, there's a really strict style guide that\nsays</i>, “This is how we lay out our code. This is how\nwe name variables. This is how we do spacing and\nindentation, and these patterns and conventions\nyou use, and this is how you declare a static field.”",
                        "page": "08",
                        "id": 9
                    },
                    {
                        "name": "Fear driven advice",
                        "text": "Your parents would rather you be OK than have a\nremarkable career at the cost of great personal risk.\n<i>More than any other third party you might look\nto, your parents are going to give you fear-driven\nadvice. Fear-driven advice is geared toward not\nlosing.</i> Thinking about not losing is not the way to\nwin! Winners take risks.",
                        "page": "09",
                        "id": 10
                    },
                    {
                        "name": "Google deadlines",
                        "text": "“Yay! A deadline!” and I get so excited that\nthe adrenaline kicks in, and I work, and I finish\nthe damn thing. <i>Nothing with Google is really a\ndeadline. With Google it's like, “What do you think\nabout launching this? How does that feel?”</i> It's rare\nthat there's some real deadline.",
                        "page": "10",
                        "id": 11
                    },
                    {
                        "name": "People complacency",
                        "text": "<i>That was a learning\nexperience in HR, that some people just do what\nthey're told and don't really have a passion\nfor excellence</i>. They're just like, “Done. Next\nassignment,” Or they don't tell you and just browse\nthe Web. So I had a couple of painful experiences.\nBut I think, after a year or two of that, I learned that\npeople are different.",
                        "page": "11",
                        "id": 12
                    },
                    {
                        "name": "Purist programmers",
                        "text": "Some are purists. They would just do abstraction\non abstraction on abstractions. They would go\nreally slowly and are very religious about their\nstyle. <i>They're like, “I'm an artisan programmer.”\nAnd I was like, “Your code doesn't run. It's not\nefficient and it doesn't look like any of the other\ncode that you're interacting with.”</i>",
                        "page": "12",
                        "id": 13
                    },
                    {
                        "name": "People motivations",
                        "text": "Other people I eventually figured out what\nmotivated them. One guy was really good at\ntinkering and getting a prototype working. He\nwrote sysadmin Perl. <i>He could wire stuff together,\nwrite shell scripts, and write really bad Perl and\nreally bad C, but kind of get it working.</i> Then we\nwould be like, “Holy crap, you researched all this\nstuff, you got all these components talking to each\nother?”",
                        "page": "13",
                        "id": 14
                    },
                    {
                        "name": "Side projects",
                        "text": "I often look for people that have done,\nlike, a lot of stuff on their own that wasn't asked\nof them. <i>Not just their school project or just what\ntheir previous employer had them do. Somebody\nwho was passionate about something and had\nsome side project.</i> How did they maintain it and\nhow serious did they get with it? Or do they do a lot\nof quick hacks and abandon them?",
                        "page": "14",
                        "id": 15
                    },
                    {
                        "name": "Real understanding",
                        "text": "<i>“Yeah, yeah, sure. I understand.” You delude\nyourself but once you actually have to get down\nand do it at a real level and understand all the\ncorner cases, it forces you to actually learn the\nthing.</i> But I don't know if that would work for\neveryone.",
                        "page": "15",
                        "id": 16
                    },
                    {
                        "name": "Smaller parts",
                        "text": "But a lot of times lately, if there's something weird\ngoing on. I'm like, <i>“OK, that function is too big;\nlet's break that up into smaller parts and unit-test\neach one of them separately to figure out where my\nassumptions are wrong</i>, rather than just sticking\nin random printIns.”",
                        "page": "16",
                        "id": 17
                    },
                    {
                        "name": "About optimization",
                        "text": "<i>Optimization is fun because it's not\nnecessary. If you're doing that, you've got your\nthing working and nothing else is more important</i>\nand you're either saving money or doing it\nbecause it's like a Perl golf contest ...",
                        "page": "17",
                        "id": 18
                    },
                    {
                        "name": "Logic and statistics",
                        "text": "<i>You don't need that much math. For most programmers, \nday to day, statistics is a lot more important.</i> \nIf you're doing graphics stuff,\nmath is a lot more important but most people\ndoing Java enterprise stuff or web stuff, it's not.\nLogic helps and statistics comes up a lot.",
                        "page": "18",
                        "id": 19
                    },
                    {
                        "name": "Social kid",
                        "text": "<i>There was some study\nabout who was successful after high school. Was it\nthe smart kids or the social kids?</i> It turned out that\nit was the social kids who ended up making all the\nmoney in life, not the people with the good grades.\nI thought that was interesting.",
                        "page": "19",
                        "id": 20
                    },
                    {
                        "name": "Bridge engineer",
                        "text": "I have a friend who's a structural engineer\nand he went to school forever and took all\nthis engineering certification stuff. <i>It's kind of\ncomforting to know that the people who build the\nbridges I'm on studied this shit forever and took\ntons of tests and stayed up all the time studying.</i>",
                        "page": "20",
                        "id": 21
                    },
                    {
                        "name": "Competing",
                        "text": "<i>I don't feel like I'm competing with anyone right now\nand I don't really care if other people are better\nbecause I feel like there are tons of people who are\nbetter already.</i> I figure we are always in the middle\nanyway, so I'm happy to stay in the middle.",
                        "page": "21",
                        "id": 22
                    }
                ]
            },
            {
                "name": "Douglas Crockford",
                "children": [
                    {
                        "name": "Language changes",
                        "text": "<i>When you're really successful, you need to be extremely\ncautious in any changes that you make.</i> Whereas\nif you haven't made it yet, you have a lot more\nfreedom in changing it around.",
                        "page": "01",
                        "id": 23
                    },
                    {
                        "name": "Ajax accident",
                        "text": "The language got frozen in 1999 and then should have gone\ninto neglect and died. <i>But instead, by accident,\nAjax happened and suddenly it's the world's most\nimportant programming language.</i>",
                        "page": "02",
                        "id": 24
                    },
                    {
                        "name": "Js worst feature",
                        "text": "<i>The worst feature of JavaScript, without question,\nis its dependence on a global object.</i> It doesn't have\nlinkers, it doesn't have any kind of information\nhiding between compilation units. It all gets\ndumped together into a common global object.",
                        "page": "03",
                        "id": 25
                    },
                    {
                        "name": "GWT js ignorant",
                        "text": "<i>Because I worry about the abstraction leakage. If\nthere's a problem in your Java code or in GWT or\nin what it produces on the other side, you may or\nmay not have a place to stand to deal with that.</i>\nParticularly if you took the approach that you can\nafford to be completely ignorant about JavaScript\nbecause the language is hidden from you.",
                        "page": "10",
                        "id": 26
                    },
                    {
                        "name": "Js smaller",
                        "text": "<i>I think the best way to make JavaScript\nbetter would be to make it smaller.</i>\nIf we could just get it down to what it does really well and\nremove the features that add little or no value,\nit's actually a better language. And I think we can.",
                        "page": "11",
                        "id": 27
                    },
                    {
                        "name": "Ajax libraries",
                        "text": "Where we do have a problem is that <i>there are too\nmany Ajax libraries. That was a consequence of the\nfact that JavaScript is so powerful and the need\nis so profound and that they're easy to make.</i> So\nfor a while everybody was making them.",
                        "page": "12",
                        "id": 28
                    },
                    {
                        "name": "Jquery selector",
                        "text": "One thing that we're seeing now is that the Ajax\nlibraries are converging. <i>jQuery came up with\na notation for using CSS selectors for getting a\nlist of objects from the DOM and then providing\nmethods for manipulating the objects en masse.</i>\nAnd that turns out to be a really good idea and\nit's something that JavaScript does very effectively.",
                        "page": "13",
                        "id": 29
                    },
                    {
                        "name": "Code reading",
                        "text": "One of the things I've been pushing is\ncode reading. <i>I think that is the most useful thing\nthat a community of programmers can do for\neach other—spend time on a regular basis reading\neach other's code.</i>",
                        "page": "14",
                        "id": 30
                    },
                    {
                        "name": "Almost done",
                        "text": "I've managed projects where we're up against a\ndeadline and we had people saying, <i>“Yeah. I'm\nalmost done,” and then you get the code, and\nthere's nothing there, or it's crap, or whatever, and\nthey're nowhere close to done.</i> In management,\nthose are the experiences you hate the most and I\nthink code reading is the best way of not getting\ntrapped like that.",
                        "page": "17",
                        "id": 31
                    },
                    {
                        "name": "Plus plus",
                        "text": "<i>They shouldn't have done that. \n++ has huge security problems—it\nencourages you to be way too tricky, to try to do too\nmuch in one line.</i> In that compulsion to do it in one\nline, you make code which is hard to understand\nand which is likely to lead to things like buffer\noverrun errors.",
                        "page": "19",
                        "id": 32
                    },
                    {
                        "name": "Continue",
                        "text": "It makes certain kinds of complicated structures\neasier to write. <i>But I found that I can always\nimprove the structure if I can find a way to factor\nit out. So as part of my personal discipline. I don't\nuse continue ever.</i>",
                        "page": "20",
                        "id": 33
                    },
                    {
                        "name": "Good code",
                        "text": "It's really difficult to write good code in a sloppy\nmanner. <i>By good code. I mean it's going to be\nreadable. At one level, it doesn't matter what it\ndoes to a machine if I can't figure out what it does</i>,\nso it might turn out that the code is amazing in\nterms of its efficiency, or its compactness, or some\nother metric which I don't care about.",
                        "page": "21",
                        "id": 34
                    },
                    {
                        "name": "Second system",
                        "text": "<i>You've got the second-system problem where\npeople who've had some success are given a blank\nslate and allowed to do whatever they want.</i>\nGenerally, they will fail because they'll be too\nambitious, they won't understand the limits.",
                        "page": "23",
                        "id": 35
                    },
                    {
                        "name": "Compatibility problems",
                        "text": "Those sort of specification errors are really, really\nhard. And we have them in the Ajax world. <i>Most\nof our problems in the Ajax world are due to the\ndifferences at the browser level. Doing the cross-\nbrowser stuff is much harder than it should be</i>\nbecause the Web is not specified well and because\nthe implementations are so variable.",
                        "page": "24",
                        "id": 36
                    },
                    {
                        "name": "All in your head",
                        "text": "I couldn't program anymore because I just\ncouldn't keep enough stuff in my head. <i>A lot\nof programming is you keep stuff in your head\nuntil you can get it written down and structured\nproperly.</i> And I just couldn't do it.",
                        "page": "25",
                        "id": 37
                    },
                    {
                        "name": "Js refactoring",
                        "text": "<i>That's one of the things that I discovered I really\nlike about JavaScript. Refactoring in JavaScript, I \nfind, is really easy.</i> Whereas refactoring a deep\nclass hierarchy can be really, really painful.",
                        "page": "28",
                        "id": 38
                    },
                    {
                        "name": "Soft objects",
                        "text": "I've become a really big fan of soft\nobjects. <i>In JavaScript, any object is whatever you\nsay it is. That's alarming to people who come at\nit from a classical perspective</i> because without a\nclass, then what have you got? It turns out you\njust have what you need, and that's really useful.",
                        "page": "29",
                        "id": 39
                    },
                    {
                        "name": "Discipline",
                        "text": "Good to be scared because it is scary and it is\nreal. It requires discipline</i>. <i>In most of the classical\nlanguages, the language is the thing imposing the\ndiscipline. In JavaScript you have to bring your\nown discipline</i>.",
                        "page": "30",
                        "id": 40
                    },
                    {
                        "name": "Js as java",
                        "text": "<i>I understand why people are frustrated with the\nlanguage. If you try to write in JavaScript as\nthough it is Java, it'll keep biting you. I did this.</i>\nOne of the first things I did in the language was\nto figure out how to simulate something that\nlooked sort of like a Java class, but at the edges it\ndidn't work anything like it.",
                        "page": "31",
                        "id": 41
                    },
                    {
                        "name": "Js tools",
                        "text": "In Javascript there is much less need of formal tools like you\nhave in other languages. <i>The browser just wants a\nsource file, and so you send it a source file, and the\ncompiler is built into the browser, so there's really\nnothing to do</i>. You don't have a linker. You don't\nhave a compiler. You don't have any of that stuff. It\njust all runs on the browser.",
                        "page": "33",
                        "id": 42
                    },
                    {
                        "name": "Browser one thread",
                        "text": "<i>One of the things I like about the browser model is\nthat we only get one thread. Some people complain\nabout that—if you lock up that thread, then the\nbrowser's locked up</i>. So you just don't do that.\nThere are constantly calls for putting threads into\nJavaScript and so far we've resisted that. I'm really\nglad we have.",
                        "page": "35",
                        "id": 43
                    },
                    {
                        "name": "Json",
                        "text": "When XML was proposed as a data-interchange\nformat, my first impression of that was, “<i>My god,\nthis is way, way, way too complicated. We don't\nneed all of this stuff just to move data back and\nforth</i>.” And so I proposed another way to do it, json, \nand it won.",
                        "page": "37",
                        "id": 44
                    },
                    {
                        "name": "Hiring",
                        "text": "I'm looking for quality of presentation.\n<i>I want to see what he thinks is something he's\nproud of. I want to see evidence that in fact he is\nthe author of the thing that he's defending.</i> I find\nthat is much more effective than asking them to\nsolve puzzles or trivia questions. I see all that kind\nof stuff as useless.",
                        "page": "42",
                        "id": 45
                    },
                    {
                        "name": "Generalists",
                        "text": "I tend not to look\nfor that kind of overspecialization unless I have a\nreally specific niche. <i>Generally, I prefer generalists.\nI want someone who's capable of learning any of\nthose APIs but isn't necessarily skilled in any one.</i>",
                        "page": "43",
                        "id": 46
                    }
                ]
            },
            {
                "name": "Jamie Zawinski",
                "children": [
                    {
                        "name": "Cross platform releases",
                        "text": "<i>If you're trying to ship a cross-platform product, \nhistory really shows that's how you don't do it. \nIf you want it to really be cross-platform, \nyou have to do them simultaneously.</i> \nThe porting thing results in a\ncrappy product on the second platform.",
                        "page": "01",
                        "id": 47
                    },
                    {
                        "name": "Multithreading in java",
                        "text": "<i>We took really good advantage of multithreading in Java, \nwhich was less painful than I had expected it to be. \nIt was just really pleasant to work on.</i> \nFrom the API we had designed \nwe saw all these directions it could grow.",
                        "page": "02",
                        "id": 48
                    },
                    {
                        "name": "Academic approach",
                        "text": "They were being extremely academic about their project. \nThey were trying to approach it from the DOM/DTD side of things. \n<i>“Oh, well, what we need to do is add another abstraction\nlayer here and have a delegate for this delegate for\nthis delegate.\"</i> And eventually a character will show\nup on the screen.",
                        "page": "03",
                        "id": 49
                    },
                    {
                        "name": "Ship the product",
                        "text": "At the end of the day, ship the fucking thing! \nIt's great to rewrite your code and\nmake it cleaner and by the third time it'll actually\nbe pretty. <i>But that's not the point — you're not here\nto write code; you're here to ship products.<i>",
                        "page": "04",
                        "id": 50
                    },
                    {
                        "name": "Competitor crap code",
                        "text": "<i>Your competitor's six-month 1.0 has crap code and\nthey're going to have to rewrite it in two years but,\nguess what:</i> they can rewrite it because you don't\nhave ajob anymore.",
                        "page": "05",
                        "id": 51
                    },
                    {
                        "name": "Inherit code rewrite",
                        "text": "<i>When you inherit code from someone else, \nsometimes it's faster to write your\nown than to reuse theirs.</i> Because it's going to take\na certain amount of time to understand their code\nand learn how to use it.",
                        "page": "06",
                        "id": 52
                    },
                    {
                        "name": "One file version",
                        "text": "<i>When I'm just writing the first version of the\nprogram. I tend to put everything in one file.\nAnd then I start seeing structure in that file.</i>\nLike there's this block of things that are pretty\nsimilar. That's a thousand lines now, so why don't\nI move that into another file. And the API sort of\nbuilds up organically that way.",
                        "page": "07",
                        "id": 53
                    },
                    {
                        "name": "Quick use",
                        "text": "I think one of the most important things, for\nme anyway, <i>when building something from the\nground up like that is, as quickly as possible,\ngetting the program to a state that you, the\nprogrammer, can use it. Even a little bit.</i> Because\nthat tells you where to go next in a really visceral\nway.",
                        "page": "08",
                        "id": 54
                    },
                    {
                        "name": "Error messages",
                        "text": "<i>A lot of programmers have the instinct of, “You've\ngot to present the error message!” No you don't.\nNo one cares about that.</i> That sort of stuff is\na lot easier to manage in languages like Java\nthat actually have an exception system.",
                        "page": "09",
                        "id": 55
                    },
                    {
                        "name": "More comments",
                        "text": "<i>I always wish people would comment more,\nthough the thing that makes me cringe is when the\ncomment is the name of the function rephrased.</i>\nFunction's called push_stack and the comment\nsays, “This pushes to the stack.” Thank you.",
                        "page": "10",
                        "id": 56
                    },
                    {
                        "name": "Ability to argue",
                        "text": "<i>Certainly with the folks I've worked with,\nability to argue their point was important because\nwe all ended up being a pretty argumentative\nbunch</i>. With that environment, that helped a lot.\nThat certainly doesn't have anything to do with\nprogramming ability.",
                        "page": "12",
                        "id": 57
                    },
                    {
                        "name": "Ignorance fear",
                        "text": "I think one thing that's really\nimportant is to not be afraid of your ignorance. \n<i>If you don't understand how something works, ask\nsomeone who does. A lot of people are skittish\nabout that. And that doesn't help anybody.</i> Not\nknowing something doesn't mean you're dumb-it\njust means you don't know it yet.",
                        "page": "13",
                        "id": 58
                    },
                    {
                        "name": "Design patterns book",
                        "text": "<i>Then there was another book that everybody\nthought was the greatest thing ever in that same\nperiod—Design Patterns—which I just thought was\ncrap.</i> It was just like, programming via cut and\npaste. Rather than thinking through your task\nyou looked through the recipe book and found\nsomething that maybe, kinda, sorta felt like it, and\nthen just aped it. That's not programming.",
                        "page": "14",
                        "id": 59
                    },
                    {
                        "name": "Books terminology",
                        "text": "Then in meetings they'd be tossing around\nall this terminology they got out of that book.\n<i>Like, the inverse, reverse, double-back-flip pattern\n—whatever. Oh, you mean a loop? OK.</i>",
                        "page": "15",
                        "id": 60
                    },
                    {
                        "name": "Under the hood",
                        "text": "<i>Wanting to know what's going on under the hood.\nI think that's really the basis of it. Without that I\ndon't think you get very far. That's your primary\nway of acquiring knowledge.</i> Taking something\napart and looking at it is how you learn to build\nyour own. At least for me. I've read very few books",
                        "page": "16",
                        "id": 61
                    }
                ]
            }
        ]
    },
    {
        "name": "Data Structures and Algorithms",
        "children": [
            {
                "name": "Jay Wengrow",
                "children": [
                    {
                        "name": "Speed",
                        "text": "<i>When we measure how “fast” an operation takes, we do not refer to how fast\nthe operation takes in terms of pure time, but instead in how many\nsteps it takes.</i>",
                        "page": "01",
                        "id": 62
                    },
                    {
                        "name": "Time complexity",
                        "text": "<i>Measuring the speed of an operation is also known as measuring\nits time complexity.</i> Efficiency, performance, and runtime are used \ninterchangeably. They all refer to the number of steps a given operation takes.",
                        "page": "02",
                        "id": 63
                    },
                    {
                        "name": "Reading arrays",
                        "text": "<i>A computer can read from an array in just one step. \nA computer's memory can be viewed as a giant collection of cells.</i> \nWhen a program declares an array, it allocates a contiguous set of\nempty cells for use in the program.",
                        "page": "03",
                        "id": 64
                    },
                    {
                        "name": "Cell value",
                        "text": "This is an important fact about computers: a computer has\nimmediate access to all of its memory addresses, <i>but it has no idea\noffhand what values are contained at each memory address.</i>",
                        "page": "04",
                        "id": 65
                    },
                    {
                        "name": "Set from array",
                        "text": "An array based set is just like an array - it is a simple list of\nvalues. <i>The only difference between this set and a classic array is that\nthe set never allows duplicate values to be inserted into it.</i>",
                        "page": "05",
                        "id": 66
                    },
                    {
                        "name": "Ordered array",
                        "text": "<i>The big advantage of an ordered array over a classic array is that\nan ordered array allows for an alternative searching algorithm.</i> This\nalgorithm is known as binary search, and it is a much, much faster\nalgorithm than linear search.",
                        "page": "06",
                        "id": 67
                    },
                    {
                        "name": "Binary search game",
                        "text": "You may know intuitively how to play the game of guessing a number between 1 and 100.\n<i>You wouldn’t begin by guessing number 1. Instead, you'd probably start with 50, which\nis smack in the middle.</i> By selecting 50, you've automatically eliminated \nhalf the possible numbers!",
                        "page": "07",
                        "id": 68
                    },
                    {
                        "name": "Borrowed concept",
                        "text": "<i>Computer scientists have borrowed a concept from the world of mathematics\nto describe the efficiency of data structures and algorithms.</i> \nKnown as Big 0 Notation, this allows us to easily categorize the efficiency \nof a given algorithm and convey it to others.",
                        "page": "08",
                        "id": 69
                    },
                    {
                        "name": "Bigo number of steps",
                        "text": "<i>Big O achieves consistency by focusing on the number of steps an\nalgorithm takes, but in a specific way.</i> Big O doesn't want to simply \ntell you how many steps an algorithm takes! It wants to tell you the story \nof how the number of steps increase as the data changes.\n",
                        "page": "09",
                        "id": 70
                    },
                    {
                        "name": "Bigo log",
                        "text": "<i>O(log N) is describing an algorithm that increases \none step each time the data is doubled.</i> \nSaid simply: O(log N) means the algorithm takes as many steps \nas it takes to keep halving the data elements until we remain with 1. \nAs you learned, binary search does just that.",
                        "page": "10",
                        "id": 71
                    },
                    {
                        "name": "Logarithm",
                        "text": "<i>Log is shorthand for logarithm. It have nothing to do with algorithms, \neven though the two words look and sound so similar.</i>\nLogarithms are the inverse of exponents. For example log2(8) means: \nhow many times do you have to multipy 2 by itself ot get 8.",
                        "page": "11",
                        "id": 72
                    },
                    {
                        "name": "Hash tables",
                        "text": "<i>Most programming languages include a data structure called a hash\ntable, and it has an amazing superpower: fast reading, O(1).</i>\nHash tables are called by different names in various programming\nlanguages: hashes, maps, hash maps, dictionaries, and associative arrays.",
                        "page": "12",
                        "id": 73
                    },
                    {
                        "name": "Hashing",
                        "text": "<i>The process of taking characters and converting them to numbers is\nknown as hashing. The code that is used to convert those letters\ninto particular numbers is called a hash function.</i> \nThere are many hashing functions. One example is taking each letter's \ncoresponding number and return the sum of all the numbers.",
                        "page": "13",
                        "id": 74
                    },
                    {
                        "name": "Stacks",
                        "text": "<i>You can think of a stack as an actual stack of dishes; you can't look at\nthe face of any dish other than the one at the top.</i> \nIn fact, most computer science literature refers to the end of the stack as its top, \nand the beginning of the stack as its bottom.",
                        "page": "14",
                        "id": 75
                    },
                    {
                        "name": "Stacks lifo",
                        "text": "<i>Stacks are ideal for processing any data that should be handled last\nin, first out.</i> The undo function in a word processor, for example, is\na great use case for a stack. As the user types, we keep track of each\nkeystroke by pushing the keystroke onto the stack.",
                        "page": "15",
                        "id": 76
                    },
                    {
                        "name": "Queues",
                        "text": "<i>You can think of a queue as a line of people at the movie theater.\nThe first one in the line is the first one to leave the line and enter\nthe theater.</i> With queues, the first item added to the queue is the\nfirst item to be removed. That's why computer scientists apply the\nacronym FIFO to queues: First In. First Out.",
                        "page": "16",
                        "id": 77
                    },
                    {
                        "name": "Dynamic programming",
                        "text": "<i>When a problem is solved by solving smaller versions of the same\nproblem, the smaller problem is called a subproblem. \nDynamic programming is the process of optimizing recursive problems that \nhave overlapping subproblems.</i> In the case of the Fibonacci sequence, we\ncompute each number by first computing the smaller numbers in\nthe sequence.",
                        "page": "17",
                        "id": 78
                    }
                ]
            }
        ]
    },
    {
        "name": "Introduction to Machine Learning",
        "children": [
            {
                "name": "Sarah Guido",
                "children": [
                    {
                        "name": "Mlearning for all",
                        "text": "<i>Many people think that machine learning can only be\napplied by large companies with extensive research teams.</i>  \nWe want to show you how easy it can be to build machine\nlearning solutions yourself, and how to best go about it.",
                        "page": "01",
                        "id": 79
                    },
                    {
                        "name": "Books",
                        "text": "<i>There are many books on machine learning and AI. However, all of\nthem are meant for graduate students or PhD students in computer\nscience, and they're full of advanced mathematics.</i> This is in stark\ncontrast with how machine learning is being used, as acommodity\ntool in research and commercial applications.",
                        "page": "02",
                        "id": 80
                    },
                    {
                        "name": "Jupyter",
                        "text": "<i>The Jupyter Notebook is an interactive environment for running\ncode in the browser.</i> It is a great tool for exploratory \ndata analysis and is widely used by data scientists. \nJupyter Notebook supports many programming languages",
                        "page": "03",
                        "id": 81
                    },
                    {
                        "name": "Matplotlib",
                        "text": "<i>When working inside the Jupyter Notebook, you can\nshow figures directly in the browser by using the %matplot1ib\nnotebook and %matplotlib inline commands.</i> We\nrecommend using %matplotlib notebook, which provides\nan interactive environment.",
                        "page": "04",
                        "id": 82
                    },
                    {
                        "name": "Pandas",
                        "text": "<i>>In contrast to NumPy, which requires that all entries in an array \nbe of the same type, pandas allows each column to have a separate type \n(for example, integers, dates, floating-point numbers, and strings).</i>  \nAnother valuable tool provided by pandas is its ability to ingest from \na great variety of file formats and databases, like SQL, Excel files, CSV files.",
                        "page": "05",
                        "id": 83
                    },
                    {
                        "name": "Name convension",
                        "text": "<i>In scikit-1earn, data is usually denoted with a capital X,\nwhile labels are denoted by a lowercase y. This is inspired by the\nstandard formulation f(x)=y in mathematics, where x is the input\ntoa function and y is the output.</i> Following more conventions\nfrom mathematics, we use a capital X because the data is a two-\ndimensional array (a matrix) and a lowercase y because the target is\na one-dimensional array (a vector).",
                        "page": "06",
                        "id": 84
                    },
                    {
                        "name": "Scatter plot",
                        "text": "<i>One of the best ways to inspect data is to visualize it. One way to\ndo this is by using a scatter plot. A scatter plot of the data puts one\nfeature along the x-axis and another along the y-axis, and draws\na dot for each data point.</i> Unfortunately, computer screens have\nonly two dimensions. It is difficult to plot datasets with more\nthan three features this way. One way around this problem is to do\na pair plot, which looks at all possible pairs of features.",
                        "page": "07",
                        "id": 85
                    },
                    {
                        "name": "Scikit classes",
                        "text": "<i>All machine learning models in scikit-1earn are implemented\nin their own classes, which are called Estimator classes.</i> \nThe k-nearest neighbors classification algorithm is implemented in the\nKNeighborsClassifier class in the neighbors module.",
                        "page": "08",
                        "id": 86
                    },
                    {
                        "name": "Supervised learning",
                        "text": "<i>Remember that supervised learning is used whenever we want to\npredict a certain outcome from a given input, and we have examples\nof input/output pairs.</i> We build a machine learning model from\nthese input/output pairs, which comprise our training set. Our\ngoal is to make accurate predictions for new, never-before-seen\ndata. Supervised learning often requires human effort to build.",
                        "page": "09",
                        "id": 87
                    },
                    {
                        "name": "Continuity",
                        "text": "<i>An easy way to distinguish between classification and regression\ntasks is to ask whether there is some kind of continuity in the output.\nIf there is continuity between possible outcomes, then the problem is\na regression problem.</i> Think about predicting annual income. There\nis a clear continuity in the output.",
                        "page": "10",
                        "id": 88
                    },
                    {
                        "name": "Overfiting",
                        "text": "<i>Overfitting occurs when you fit amodel too closely to the particularities \nof the training set and obtain a model that works well on the training set \nbut is not able to generalize to new data.<i> On the other hand, if your model is too\nsimple.",
                        "page": "11",
                        "id": 89
                    },
                    {
                        "name": "Knn not used",
                        "text": "<i>So, while the k-nearest neighbors algorithm is easy to understand,\nit is not often used in practice, due to prediction being slow and its\ninability to handle many features.</i> The other methods we discuss has\nneither of these drawbacks.",
                        "page": "12",
                        "id": 90
                    }
                ]
            }
        ]
    },
    {
        "name": "Machine Learning Simplified",
        "children": [
            {
                "name": "Andrew Wolf",
                "children": [
                    {
                        "name": "Supervised ml",
                        "text": "<i>The goal of supervised ML is to make\npredictions about unknown quantities given known\nquantities,</i> such as predicting a house's sale price based\non its location and square footage, or predicting a fruit\ncategory given the fruit’s width and height.",
                        "page": "11",
                        "id": 91
                    },
                    {
                        "name": "Categorical and numerical",
                        "text": "<i>Supervised machine learning models try to predict either \na categorical target variable (predicting a fruit category based on its weight and height),</i> \nor a numerical target variable (predicting the price of an apartment, \nbased on its area and location).</i>",
                        "page": "12",
                        "id": 92
                    },
                    {
                        "name": "Classification problem",
                        "text": "<i>In a classification problem we try to predict an\nunknown category, called a class label based on a set\nof known, or observed, variables.</i> There is an endless\nnumber of classification problems: as long as a target\nvariable is categorical, a set of classes could be anything.",
                        "page": "13",
                        "id": 93
                    },
                    {
                        "name": "Supervise ml learning",
                        "text": "<i>Supervised ML learns\nthe relationships between different measurements and\nthe label. After the model is learned (or trained), we\ncan then use it to predict the label of a new</i> (unseen)\ndata point from its known measurements (but totally\nunknown label).",
                        "page": "16",
                        "id": 94
                    },
                    {
                        "name": "Limited ai",
                        "text": "Usually a human being must provide these labels\nthat the machine learns from. <i>Machine Learning is\nthe main and most well-known example of Limited\nAI, and the email spam detector is an example of\nsupervised ML.</i>",
                        "page": "29",
                        "id": 95
                    },
                    {
                        "name": "Advanced ai",
                        "text": "<i>Advanced AI systems will possess the\nintelligence of human beings. They will be able to,\nfor example, drive your car, recognize your face</i>, have\nconversations with other human beings, understand\ntheir emotions, and perform any task that an\nintelligent human could do.",
                        "page": "30",
                        "id": 96
                    },
                    {
                        "name": "Prediction function",
                        "text": "Formally, supervised ML seeks to learn a prediction function f\nthat maps each joint setting of the input variables features to\na value of the target variable, X -> y. <i>In our fruit classification\nexample, we must learn a function that maps any combination\nof height and width of a fruit to a (predicted) fruit type</i>.",
                        "page": "36",
                        "id": 97
                    },
                    {
                        "name": "Overfitting",
                        "text": "Although you got a very low error on the\ntraining set (0% wrong) you got a higher error on the test\nset (60% wrong). <i>This problem, where the error is low on\nthe training set, but much higher on an unseen test set, is a\ncentral problem in ML known as overfitting.</i>",
                        "page": "45",
                        "id": 98
                    },
                    {
                        "name": "Optimal balances",
                        "text": "<i>The goal in Machine Learning is to find a generic model \nthat optimally balances the overfitting and underfitting\nof data</i>. Model complexity is defined with the hyperparameters\nof the model itself. Each model has its own set of\nhyperparameters. The complexity of a KNN classifier is defined\nby the hyper-parameter k.",
                        "page": "49",
                        "id": 99
                    }
                ]
            }
        ]
    },
    {
        "name": "Machine Learning with Python Cookbook",
        "children": [
            {
                "name": "Chris Albon",
                "children": [
                    {
                        "name": "Numpy foundation",
                        "text": "<i>NumPy is the foundation of the Python machine learning stack.</i>\nNumPy allows for efficient operations on the data structures often\nused in machine learning: vectors, matrices, and tensors.\n        \n\n",
                        "page": "01",
                        "id": 100
                    },
                    {
                        "name": "Multidimensional array",
                        "text": "<i>NumPy’s main data structure is the multidimensional array. To\ncreate a vector, we simply create a one-dimensional array.</i> Just like\nvectors, these arrays can be represented horizontally (rows) or\nvertically (columns).",
                        "page": "02",
                        "id": 101
                    },
                    {
                        "name": "Sparse matrices",
                        "text": "<i>A frequent situation in machine learning is having a huge amount\nof data. However, most of the elements in the data are zeros.</i> \nSparse matrices only store nonzero elements and assume all other\nvalues will be zero, leading to significant computational savings.",
                        "page": "03",
                        "id": 102
                    },
                    {
                        "name": "Vectorize",
                        "text": "<i>NumPy’s vectorize class converts a function into a function\nthat can apply to all elements in an array or slice of an array.</i> \nIt’s worth noting that vectorize is essentially a for loop over the\nelements and does not increase performance.",
                        "page": "04",
                        "id": 103
                    },
                    {
                        "name": "Raw data",
                        "text": "<i>The first step in any machine learning endeavor is to get the raw\ndata into our system. The raw data might be a logfile, dataset file,\nor database.</i> Furthermore, often we will want to retrieve data from\nmultiple sources.",
                        "page": "05",
                        "id": 104
                    },
                    {
                        "name": "Toy datasets",
                        "text": "<i>Often we do not want to go through the work of loading,\ntransforming, and cleaning a real-world dataset before we can\nexplore some machine learning algorithm or method.</i> \nScikit-learn comes with some common datasets we can quickly load. \nThese datasets are often called “toy” datasets because they are far smaller\nand cleaner than a dataset we would see in the real world.",
                        "page": "06",
                        "id": 105
                    },
                    {
                        "name": "Data wrangling",
                        "text": "<i>Data wrangling is a broad term used, often informally, to describe\nthe process of transforming raw data to a clean and organized\nformat ready for use.</i> For us, data wrangling is only one step in\npreprocessing our data, but itis an important step.",
                        "page": "07",
                        "id": 106
                    },
                    {
                        "name": "Data frame",
                        "text": "<i>The most common data structure used to “wrangle” data is the\ndata frame, which can be both intuitive and incredibly versatile.</i>\nData frames are tabular, meaning that they are based on rows and\ncolumns like you would see in a spreadsheet.",
                        "page": "09",
                        "id": 107
                    },
                    {
                        "name": "Tokenization",
                        "text": "<i>Tokenization, especially word tokenization, is a common task\nafter cleaning text data because it is the first step in the process\nof turning the text into data</i> we will use to construct useful\nfeatures.",
                        "page": "10",
                        "id": 108
                    },
                    {
                        "name": "Stop words",
                        "text": "<i>While “stop words” can refer to any set of words we want\nto remove before processing, frequently the term refers to\nextremely common words that themselves contain little\ninformation value</i>. NLTK has a list of common stop words that\nwe can use to find and remove stop words in our tokenized\nwords.",
                        "page": "11",
                        "id": 109
                    },
                    {
                        "name": "Stemming",
                        "text": "<i>Stemming reduces a word to its stem by identifying and removing\naffixes (gerunds) while keeping the root meaning of the word.\nFor example, both “tradition” and “traditional” have “tradit” as their\nstem</i>, indicating that while they are different words they represent\nthe same general concept.",
                        "page": "12",
                        "id": 110
                    }
                ]
            }
        ]
    },
    {
        "name": "Passionate Programmer",
        "children": [
            {
                "name": "Chad Fowler",
                "children": [
                    {
                        "name": "Low expectations",
                        "text": "<i>Most of us are content to go with the\nflow. Our expectations have been lowered for us\nby the media and by our friends, acquaintances,\nand family members</i>. So, leading a remarkable life\nis something you have to discover as even being a\nreasonable goal. It’s not obvious.",
                        "page": "01",
                        "id": 111
                    },
                    {
                        "name": "Loving your work",
                        "text": "<i>If your life is primarily consumed by your work,\nthen loving your work is one of the most\nimportant keys to loving your life.</i> Challenging,\nmotivating, rewarding work is more likely to make\nyou want to get up in the morning than dull,\naverage tasks. Doing your job well means that the\nactivity you do for 50 percent of your available\ntime is something you're good at.",
                        "page": "02",
                        "id": 112
                    },
                    {
                        "name": "Higher salary",
                        "text": "A higher salary might\nactually be desirable and lead toward happiness.\n<i>But if you take your eyes off the primary goal,\nyou can find yourself driving toward a higher\nsalary at the expense of your happiness.</i> It sounds\nridiculous, but I’ve done it. And so have you.",
                        "page": "03",
                        "id": 113
                    },
                    {
                        "name": "Business purpose",
                        "text": "<i>As software developers, we are\nbusinesspeople. Our companies don’t employ us\nbecause they love us.</i> They never have, and they\nnever will. That’s not the job of a business.\nBusinesses don’t exist so we can have a place to go\nevery day.",
                        "page": "04",
                        "id": 114
                    },
                    {
                        "name": "Old systems",
                        "text": "<i>In those stages, the old systems have to talk to the new systems.\nSomeone has to know how to make the new speak\nto the old, and vice versa.</i> Typically, the young\ntykes don’t know (or want to know) how to make\nthe old systems listen.",
                        "page": "05",
                        "id": 115
                    },
                    {
                        "name": "Business language",
                        "text": "<i>You might be “just a programmer,” but being able\nto speak to your business clients in the language\nof their business domain is a critical skill.</i> Imagine\nhow much easier life would be if everyone you\nhad to work with really understood how software\ndevelopment works.",
                        "page": "06",
                        "id": 116
                    },
                    {
                        "name": "Candidate pool",
                        "text": "<i>The addition of Smalltalk to the requirements list\nyielded a candidate pool that was tiny in contrast\nto our previous list.</i> These people were diamonds\nin the rough. They really understood object-oriented programming.",
                        "page": "07",
                        "id": 117
                    },
                    {
                        "name": "Take opportunity",
                        "text": "It drives me crazy to ask people whether\nthey've seen or used certain not-quite-mainstream\ntechnologies only to hear, <i>“I haven't been given the\nopportunity to work on that” in return. Given the\nopportunity? Neither was I! I took the opportunity\nto learn.</i>",
                        "page": "08",
                        "id": 118
                    },
                    {
                        "name": "Unix guy",
                        "text": "<i>Another artificial (and inexcusable) line gets\ndrawn around platforms or operating systems.</i>\nBeing a UNIX Guy who refuses to do Windows\nis increasingly more impractical.",
                        "page": "09",
                        "id": 119
                    },
                    {
                        "name": "Developer environment",
                        "text": "<i>It’s rare, and refreshing,\nto find a developer who truly understands\nthe platform on which he or she is working.</i>\nApplications are better and work gets done faster\nas a result.",
                        "page": "10",
                        "id": 120
                    },
                    {
                        "name": "Rate himself",
                        "text": "I asked this person (and all the\nothers I had interviewed that week) to rate himself\nona scale of one to ten. He said nine. I’m expecting\na star here. <i>If this guy rates himself so high, why\ncan’t he think of a single abusive programming\ntrick that would cause a JVM to crash?</i>",
                        "page": "11",
                        "id": 121
                    },
                    {
                        "name": "Specializing in something",
                        "text": "<i>Too many of us seem to believe that specializing\nin something simply means you don’t know about\nother things.</i> I could, for example, call my mother\na Windows specialist, because she has never used \nLinux.",
                        "page": "12",
                        "id": 122
                    },
                    {
                        "name": "Changing computer industry",
                        "text": "This is the kind of specialist who will survive\nin the changing computer industry. If you're\na .NET specialist, it’s not just an excuse for not\nknowing anything except .NET. <i>It means that if\nit has to do with .NET, you are the authority. IIS\nservers hanging and needing to be rebooted? “No\nproblem.” Source control integration with Visual\nStudio .NET? “I’ll show you how.”</i>",
                        "page": "13",
                        "id": 123
                    },
                    {
                        "name": "Impostor syndrome",
                        "text": "<i>When I showed up on the job. I was paranoid\nI would be discovered as the charlatan I really\nwas. What is this saxophone player doing here with\nus trained professionals?</i> After all. I was working\nwith people who had advanced computer science\ndegrees. And, here I was with only part of a music\ndegree trying to fit in as if I knew something.",
                        "page": "14",
                        "id": 124
                    },
                    {
                        "name": "Master degree notes",
                        "text": "Within a few days of work, the truth started to\nsink in. <i>These people don’t know what the hell they’ve\ndoing! In fact, some people were watching me work\nand taking notes!</i> People with master’s degrees in\ncomputer science!",
                        "page": "15",
                        "id": 125
                    }
                ]
            }
        ]
    },
    {
        "name": "Pro Git",
        "children": [
            {
                "name": "Scott Chacon",
                "children": [
                    {
                        "name": "Version control",
                        "text": "What is “version control,” and why should you care? <i>Version\ncontrol is a system that records changes to a file or set of files\nover time so that you can recall specific versions later.</i> You can do this\nwith nearly any type of file on a computer.",
                        "page": "01",
                        "id": 126
                    },
                    {
                        "name": "Dvcs",
                        "text": "<i>In a Distributed Version Control Systems (such as Git), \nclients don't just check out the latest snapshot of the files, they fully\nmirror the repository.</i> Thus if any server dies, any of the client repositories can be\ncopied back up to the server to restore it. Every checkout is really\na full backup of all the data.",
                        "page": "04",
                        "id": 127
                    },
                    {
                        "name": "Git creator",
                        "text": "In 2005, the relationship between the community that\ndeveloped the Linux kernel and the commercial company that\ndeveloped BitKeeper broke down. <i>This prompted the Linux development\ncommunity (and in particular Linus Torvalds, the creator of\nLinux) to develop their own tool based on some of the lessons\nthey learned while using BitKeeper.</i>",
                        "page": "05",
                        "id": 128
                    },
                    {
                        "name": "Snapshots",
                        "text": "<i>Git thinks of its data more like a set of snapshots of a miniature\nfilesystem. Every time you commit, it basically takes a picture of what all your files\nlook like at that moment and stores a reference to that snapshot.</i>\nTo be efficient, if files have not changed, Git doesn’t store the\nfile again, just a link to the previous identical file it has already\nstored.",
                        "page": "06",
                        "id": 129
                    },
                    {
                        "name": "Check summed",
                        "text": "<i>Everything in Git is check-summed before it is stored and is\nthen referred to by that checksum. This means it’s impossible to\nchange the contents of any file or directory without Git knowing\nabout it.</i> This functionality is built in to Git at the lowest levels\nand is integral to its philosophy.",
                        "page": "07",
                        "id": 130
                    },
                    {
                        "name": "Tree states",
                        "text": "<i>Git has three main states that your files can reside\nin: committed, modified, and staged. Committed means that the\ndata is safely stored in your local database.</i> Modified means that\nyou have changed the file but have not committed it to your\ndatabase yet. Staged means that you have marked a modified file\nin its current version to go into your next commit snapshot.",
                        "page": "08",
                        "id": 131
                    },
                    {
                        "name": "Staging area",
                        "text": "<i>The staging area is a file, generally contained in your Git\ndirectory, that stores information about what will go into your\nnext commit.</i> It’s sometimes referred to as the “index”, but it’s\nalso common to refer to it as the staging area.",
                        "page": "09",
                        "id": 132
                    },
                    {
                        "name": "Git repository",
                        "text": "<i>You can get a Git project using two main approaches. The first\ntakes an existing project or directory and imports it into Git.</i> The\nsecond clones an existing Git repository from another server.",
                        "page": "15",
                        "id": 133
                    },
                    {
                        "name": "Ignore files",
                        "text": "<i>Often, you'll have a class of files that you don’t want Git to\nautomatically add or even show you as being untracked.</i> In such cases, you can\ncreate a file listing patterns to match them named . gitignore",
                        "page": "20",
                        "id": 134
                    }
                ]
            }
        ]
    },
    {
        "name": "Programmer Guide to Computer Science",
        "children": [
            {
                "name": "William Springer",
                "children": [
                    {
                        "name": "Program algorithm",
                        "text": "This is a program: you define every step that the computer needs to\ntake and specify all the information the computer requires to execute\neach step. <i>This is an algorithm: a process to follow to reach the desired\noutcome. The algorithm is much more abstract than a program.</a>",
                        "page": "01",
                        "id": 135
                    },
                    {
                        "name": "Arrays",
                        "text": "<i>An array is a collection of elements indexed by a key. \nThe key represents an offset from the starting location in memory, \nso that we can calculate the location of any element given its key.</i> \nThis is why array indices generally start with zero; the first\nelement of an array is zero elements away from the start, the next\nis one element away from the start, and so on.",
                        "page": "02",
                        "id": 136
                    },
                    {
                        "name": "Linked lists",
                        "text": "<i>A linked list is a data structure where every element contains both\ndata and a pointer to the next element in the list</i>. A pointer to a linked\nlist is simply a pointer to the first element, or head, of the list. \nFinding a specified element requires starting at the head and walking\nthrough the list. ",
                        "page": "03",
                        "id": 137
                    },
                    {
                        "name": "Stack braces",
                        "text": " <i>A common example of using a stack is checking for balanced braces.\nWe can read in a string and, every time a left brace is encountered, we push\nit on the stack. Every time a right brace is encountered, we pop a left\nbrace off the stack.</i> If we ever try to pop a brace from the stack and\nfind it empty, then there is a right brace without a matching left brace\npreceding it.\n",
                        "page": "03",
                        "id": 138
                    }
                ]
            }
        ]
    },
    {
        "name": "Random Forests And Decision Trees",
        "children": [
            {
                "name": "Scott Hartshorn",
                "children": [
                    {
                        "name": "Random forests",
                        "text": "<i>Random Forests are simply a collection of Decision Trees that have\nbeen generated using a random subset of data</i>. The name “Random\nForest” comes from combining the randomness that is used to pick\nthe subset of data</i> with having a bunch of decision trees, hence a\nforest.",
                        "page": "01",
                        "id": 139
                    },
                    {
                        "name": "Branches",
                        "text": "<i>The way that Random Forest deals with that is to not let the trees\nlook at all of the features.</i> At any given branch in the decision tree,\nonly a subset of the features are available for it to classify on. Other\nbranches, even higher or lower branches on the same tree, will have\ndifferent features that they can classify on.",
                        "page": "02",
                        "id": 140
                    },
                    {
                        "name": "Features number",
                        "text": "<i>In many implementations of the Random Forest algorithm, it will\nuse the square root of the number of features as the maximum\nfeatures that it will look on any given branch.</i> Using fewer than all\nof the available features is another way to add randomness to the\nresults (and avoid overfitting) as well as reduce the time required to\ncreate the trees.",
                        "page": "03",
                        "id": 141
                    },
                    {
                        "name": "Cross validation",
                        "text": "<i>This is a technique known as Cross Validation and it is extremely useful.\nOnce you make a machine learning model, you set aside a\nportion, say 10%, of your training data before you train on it.</i> \nAfter fitting your machine learning algorithm to your training data, you\ncan run the 10% set aside through your classifier and find out if those\npredictions match the actual values.",
                        "page": "04",
                        "id": 142
                    }
                ]
            }
        ]
    },
    {
        "name": "Show your work",
        "children": [
            {
                "name": "Austin Kleon",
                "children": [
                    {
                        "name": "Self promotion",
                        "text": "<i>I hate talking about self-promotion. Comedian\nSteve Martin famously dodges these questions\nwith the advice, “Be so good they can’t ignore you.”\nIf you just focus on getting really good. Martin\nsays, people will come to you.</i> I happen to agree.",
                        "page": "01",
                        "id": 143
                    },
                    {
                        "name": "Findable",
                        "text": "You don’t really find an audience for your work;\nthey find you. <i>But it’s not enough to be good. In\norder to be found, you have to be findable.</i> I think\nthere’s an easy way of putting your work out there\nand making it discoverable while you're focused on\ngetting really good.",
                        "page": "02",
                        "id": 144
                    },
                    {
                        "name": "Sharing routine",
                        "text": "<i>Almost all of the people I look up to and try to steal\nfrom today, regardless of their profession, have\nbuilt sharing into their routine.</i> These people aren’t\nschmoozing at cocktail parties; they’re too busy\nfor that.",
                        "page": "03",
                        "id": 145
                    },
                    {
                        "name": "No resume",
                        "text": "<i>Imagine if your next boss didn’t have to read\nyour résumé because he already reads your blog.</i>\nImagine being a student and getting your first\ngig based on a school project you posted online.",
                        "page": "04",
                        "id": 146
                    },
                    {
                        "name": "Support",
                        "text": "Imagine losing your job but having a social\nnetwork of people familiar with your work and\nready to help you find a new one. <i>Imagine turning\na side project or a hobby into your profession\nbecause you had a following that could support you.</i>",
                        "page": "05",
                        "id": 147
                    },
                    {
                        "name": "Amateurs",
                        "text": "<i>We're all terrified of being revealed as amateurs, \nbut in fact, today it is the amateur—the enthusiast\nwho pursues her work in the spirit of love</i>, \nregardless of the potential for fame, money, \nor career—who often has the \nadvantage over the professional.",
                        "page": "07",
                        "id": 148
                    },
                    {
                        "name": "Doing nothing",
                        "text": "<i>Mediocrity is, however, still\non the spectrum; you can move from mediocre\nto good in increments. The real gap is between\ndoing nothing and doing something</i>.” \nAmateurs know that contributing something \nis better than contributing nothing.",
                        "page": "09",
                        "id": 149
                    },
                    {
                        "name": "Lifelong learners",
                        "text": "<i>Amateurs might lack formal training, but\nthey’re all lifelong learners, and they make a\npoint of learning in the open</i>, so that others\ncan learn from their failures and successes.",
                        "page": "10",
                        "id": 150
                    },
                    {
                        "name": "Amateur help",
                        "text": "Sometimes, amateurs have more to teach\nus than experts. <i>“It often happens that two\nschoolboys can solve difficulties in their\nwork for one another better than the master\ncan,”</i> wrote author C. S. Lewis.",
                        "page": "11",
                        "id": 151
                    },
                    {
                        "name": "Fellow pupil",
                        "text": "<i>The fellow-pupil can help more than the master because\nhe knows less. The difficulty we want him\nto explain is one he has recently met.</i> \nThe expert met it so long ago he has forgotten.”\nWatching amateurs at work can also inspire\nus to attempt the work ourselves.",
                        "page": "12",
                        "id": 152
                    },
                    {
                        "name": "Changing rate",
                        "text": "<i>The world is changing at such a rapid\nrate that it’s turning us all into amateurs.</i>\nEven for professionals, the best way to\nflourish is to retain an amateur’s spirit\nand embrace uncertainty and the unknown.",
                        "page": "13",
                        "id": 153
                    },
                    {
                        "name": "Use your voice",
                        "text": "We're always being told find your voice. \nWhen I was younger, I never really knew what this\nmeant. <i>I used to worry a lot about voice,\nwondering if I had my own. But now I realize\nthat the only way to find your voice is to use\nit.</i> It’s hardwired, built into you. Talk about\nthe things you love. Your voice will follow.",
                        "page": "14",
                        "id": 154
                    },
                    {
                        "name": "Not all artists",
                        "text": "Now, let’s face it: We’re not all artists or\nastronauts. A lot of us go about our work\nand feel like we have nothing to show for\nit at the end of the day.<i> But whatever the\nnature of your work, there is an art to what\nyou do, and there are people who would be\ninterested in that art.</i>",
                        "page": "15",
                        "id": 155
                    },
                    {
                        "name": "Make stuff",
                        "text": "<i>“You have to make stuff,” said journalist David Carr\nwhen he was asked if he had any advice for students.\n“No one is going to give a damn about your\nrésumé;</i> they want to see what you have\nmade with your own little fingers.”",
                        "page": "16",
                        "id": 156
                    },
                    {
                        "name": "Documenting",
                        "text": "<i>Whether you share it or not, documenting and\nrecording your process as you go along has its own\nrewards:</i> You'll start to see the work you're doing\nmore clearly and feel like you’re making progress.\nAnd when you're ready to share, you'll have a\nsurplus of material to choose from.",
                        "page": "17",
                        "id": 157
                    },
                    {
                        "name": "90 crap",
                        "text": "Don’t worry about everything you post being perfect. \n<i>Science fiction writer Theodore Sturgeon once said \nthat 90 percent of everything is crap. The same is true \nof our own work.</i> The trouble is, we don’t always know \nwhat’s good and what sucks. That’s why it’s important \nto get things in front of others and see how they react.",
                        "page": "19",
                        "id": 158
                    },
                    {
                        "name": "Next day",
                        "text": "Don’t overthink it; just go with your gut.\nIf you’re unsure about whether to share\nsomething, let it sit for 24 hours. Put it in a\ndrawer and walk out the door. <i>The next day,\ntake it out and look at it with fresh eyes. Ask\nyourself, “Is this helpful? Is it entertaining?\nIs it something I'd be comfortable with my\nboss or my mother seeing?”</i>",
                        "page": "20",
                        "id": 159
                    },
                    {
                        "name": "Stock and flow",
                        "text": "“Stock and flow” is an economic concept\nthat writer Robin Sloan has adapted into a\nmetaphor for media: “<i>Flow is the feed. It’s the\nposts and the tweets. It’s the stream of daily\nand sub-daily updates that remind people\nyou exist. Stock is the durable stuff.</i>",
                        "page": "21",
                        "id": 160
                    },
                    {
                        "name": "Invention machine",
                        "text": "<i>Don’t think of your website as a \nself-promotion machine, think of it as a \nself-invention machine.</i> Online, you can \nbecome the person you really want to be. \nFill your website with your work and your \nideas and the stuff you care about.",
                        "page": "22",
                        "id": 161
                    },
                    {
                        "name": "Loving your garbage",
                        "text": "<i>We all love things that other people think are\ngarbage. You have to have the courage to keep\nloving your garbage, because what makes us\nunique is the diversity and breath of our\ninfluences</i>, the unique ways in which we mix\nup the parts of culture others have deemed\n“high” and the “low.”",
                        "page": "23",
                        "id": 162
                    },
                    {
                        "name": "Proper credit",
                        "text": "Crediting work in our copy-and-paste \nage of reblogs and retweets can seem like \na futile effort, but it’s worth it, and\nit’s the right thing to do. <i>You should always\nshare the work of others as if it were your\nown, treating it with respect and care.</i>",
                        "page": "25",
                        "id": 163
                    },
                    {
                        "name": "About stories",
                        "text": "John Gardner said the basic plot of nearly all\nstories is this: <i>“A character wants something,\ngoes after it despite opposition (perhaps\nincluding his own doubts), and so arrives at\na win, lose, or draw.”</i> I like Gardner's plot\nformula because it’s also the shape of most\ncreative work.",
                        "page": "26",
                        "id": 164
                    },
                    {
                        "name": "Nonfiction",
                        "text": "<i>Just because you're trying to tell a good\nstory about yourself doesn’t mean you're\ninventing fiction. Stick to nonfiction.</i> \nTell the truth and tell it with dignity \nand self-respect. If you're a student, \nsay you're a student. If you work a day job, \nsay you work a day.",
                        "page": "27",
                        "id": 165
                    },
                    {
                        "name": "Something disgraceful",
                        "text": "Maybe you're in the wrong line of work,\nor maybe you're not doing the work you're\nsupposed to be doing. \n<i>Remember what the author George Orwell\nwrote: “Autobiography is only to be trusted\nwhen it reveals something disgraceful.”</i>",
                        "page": "28",
                        "id": 166
                    },
                    {
                        "name": "Human spam",
                        "text": "<i>I call these people human spam. They’re\neverywhere, and they exist in every\nprofession.</i> They don’t want to pay their\ndues, they want their piece right here, right\nnow. They don’t want to listen to your ideas.",
                        "page": "31",
                        "id": 167
                    },
                    {
                        "name": "Good citizen",
                        "text": "If you want fans, you have to be a fan first.\n<i>If you want to be accepted by a community,\nyou have to first be a good citizen of that\ncommunity.</i> If you’re only pointing to your\nown stuff online, you're doing it wrong.",
                        "page": "32",
                        "id": 168
                    },
                    {
                        "name": "Real peers",
                        "text": "These are your real peers - <i>the people who\nshare your obsessions, the people who share\na similar mission to your own, the people\nwith whom you share a mutual respect.</i>\nThere will only be a handful or so of them,\nbut they’re so, so important.",
                        "page": "35",
                        "id": 169
                    },
                    {
                        "name": "Criticism",
                        "text": "Designer Mike Monteiro says that the most\nvaluable skill he picked up in art school was\nlearning how to take a punch. <i>He and his\nfellow classmates were absolutely brutal during\ncritiques. “We were basically trying to see if we\ncould get each other to drop out of school.”</i> \nThose vicious critiques taught him \nnot to take criticism personally.",
                        "page": "36",
                        "id": 170
                    },
                    {
                        "name": "Fear imagination",
                        "text": "The trouble with imaginative people is \nthat we’re good at picturing the worst that \ncould happen to us. Fear is often just the imagination\ntaking a wrong turn. <i>Bad criticism is not \nthe end of the world. As far as I know, \nno one has ever died from a bad review.</i> \nTake a deep breath and accept whatever comes.",
                        "page": "37",
                        "id": 171
                    },
                    {
                        "name": "Hated work",
                        "text": "You can’t control what sort of criticism you receive, \nbut you can control how you react to it. \n<i>Sometimes when people hate something about your work, \nit’s fun to push that element even further. \nTo make something they’d hate even more.</i>\nHaving your work hated by certain people is a badge of honor.",
                        "page": "38",
                        "id": 172
                    },
                    {
                        "name": "Keep your balance",
                        "text": "You have to remember that your work is something you do, \nnot who you are. This is especially hard for artists\nto accept, as so much of what they do is\npersonal. <i>Keep close to your family, friends,\nand the people who love you for you, not just\nthe work.</i>",
                        "page": "39",
                        "id": 173
                    },
                    {
                        "name": "Troll",
                        "text": "<i>A troll is a person who isn’t interested in\nimproving your work, only provoking you\nwith hateful, aggressive, or upsetting talk.</i>\nYou will gain nothing by engaging with these\npeople. Don’t feed them, and they'll usually\ngo away.",
                        "page": "40",
                        "id": 174
                    },
                    {
                        "name": "Nasty comments",
                        "text": "Do you have a troll problem? Use the block\nbutton on social media sites. <i>Delete nasty\ncomments. My wife is fond of saying, “If\nsomeone took a dump in your living room,\nyou wouldn't let it sit there, would you?”</i>\nNasty comments are the same-they should\nbe scooped up and thrown in the trash.",
                        "page": "41",
                        "id": 175
                    }
                ]
            }
        ]
    },
    {
        "name": "Steal Like an Artist",
        "children": [
            {
                "name": "Austin Kleon",
                "children": [
                    {
                        "name": "People advice",
                        "text": "It’s one of my theories that <i>when people\ngive you advice, they’re really just\ntalking to themselves in the past. \nThis book is me talking to a previous\nversion of myself.</i>",
                        "page": "01",
                        "id": 176
                    },
                    {
                        "name": "Unknown reference",
                        "text": "The writer Jonathan Lethem has said that when\n<i>people call something “original,” nine out of ten\ntimes they just don’t know the references</i> or the\noriginal sources involved.",
                        "page": "02",
                        "id": 177
                    },
                    {
                        "name": "No one listening",
                        "text": "Some people find this idea depressing, but it\nfills me with hope. As the French writer André\nGide put it, <i>“Everything that needs to be said has\nalready been said. But, since no one was listening,\neverything must be said again.”</i>",
                        "page": "03",
                        "id": 178
                    },
                    {
                        "name": "Friendly ghosts",
                        "text": "<i>Seeing yourself as part of a creative lineage will\nhelp you feel less alone as you start making your\nown stuff</i>. I hang pictures of my favorite artists\nin my studio. They’re like friendly ghosts. I can\nalmost feel them pushing me forward as I’m\nhunched over my desk.",
                        "page": "04",
                        "id": 179
                    },
                    {
                        "name": "Remote masters",
                        "text": "<i>The great thing about dead or remote masters is\nthat they can’t refuse you as an apprentice.</i> You\ncan learn whatever you want from them. They left\ntheir lesson plans in their work.",
                        "page": "05",
                        "id": 180
                    },
                    {
                        "name": "Get your education",
                        "text": "School is one thing. Education is another. The two\ndon’t always overlap. <i>Whether you're in school\nor not, it’s always your job to get yourself an\neducation.</i>",
                        "page": "06",
                        "id": 181
                    },
                    {
                        "name": "Go deeper",
                        "text": "You have to be curious about the world in which\nyou live. Look things up. <i>Chase down every\nreference. Go deeper than anybody else—that’s\nhow you'll get ahead.</i>",
                        "page": "07",
                        "id": 182
                    },
                    {
                        "name": "Google everything",
                        "text": "Google everything. I mean everything.\nGoogle your dreams. Google your problems.\n<i>Don’t ask a question before you Google it.\nYou'll either find the answer or you'll come\nup with a better question.</i>",
                        "page": "08",
                        "id": 183
                    },
                    {
                        "name": "Start book",
                        "text": "Always be reading. Go to the library. <i>There’s\nmagic in being surrounded by books. Get lost\nin the stacks. Read bibliographies. It’s not the\nbook you start with, it’s the book that book\nleads you to.</i>",
                        "page": "09",
                        "id": 184
                    },
                    {
                        "name": "Unread books",
                        "text": "Collect books, even if you don’t plan on reading\nthem right away. <i>Filmmaker John Waters has said,\n“Nothing is more important than an unread library.”</i>",
                        "page": "10",
                        "id": 185
                    },
                    {
                        "name": "Impostor syndrome",
                        "text": "About impostore syndrome. <i>The clinical definition is a “psychological\nphenomenon in which people are unable to\ninternalize their accomplishments</i>.” It means that\nyou feel like a phony, like you're just winging it,\nthat you really don’t have any idea what you're\ndoing.",
                        "page": "11",
                        "id": 186
                    },
                    {
                        "name": "Not plagiarism",
                        "text": "We're talking about practice here, not plagiarism.\n<i>Plagiarism is trying to pass someone else’s\nwork off as your own. Copying is about reverse-\nengineering.</i>  It’s like a mechanic taking apart a car\n‘to see how it works.",
                        "page": "12",
                        "id": 187
                    },
                    {
                        "name": "Research",
                        "text": "the people you want to be. The songwriter Nick\nLowe says, “You start out by rewriting your hero’s\ncatalog.” And you don’t just steal from one of your\nheroes, you steal from all of them. <i>The writer\nWilson Mizner said if you copy from one author,\nit’s plagiarism, but if you copy from many, it’s\nresearch</i>.",
                        "page": "13",
                        "id": 188
                    },
                    {
                        "name": "Emulation",
                        "text": "At some point, you'll have to move from\nimitating your heroes to emulating them.\n<i>Imitation is about copying. Emulation\nis when imitation goes one step further,\nbreaking through into your own thing.</i>",
                        "page": "14",
                        "id": 189
                    },
                    {
                        "name": "Adapt the moves",
                        "text": "“There isn’t a move that’s a new move.” <i>The\nbasketball star Kobe Bryant has admitted that\nall of his moves on the court were stolen from\nwatching tapes of his heroes.</i> He realized he\ncouldn’t completely pull them off because he\ndidn’t have the same body type as the guys he was\nthieving from. He had to adapt to make them his own.",
                        "page": "15",
                        "id": 190
                    },
                    {
                        "name": "Adding something",
                        "text": "In the end, <i>merely imitating your heroes is not\nflattering them. Transforming their work into\nsomething of your own is how you flatter them.</i>\nAdding something to the world that only you can\nadd.",
                        "page": "16",
                        "id": 191
                    },
                    {
                        "name": "Make stuff",
                        "text": "The manifesto is this: <i>Draw the art you want to\nsee, start the business you want to run, play the\nmusic you want to hear, write the books you want\nto read, build the products you want to use</i>—do\nthe work you want to see done.",
                        "page": "17",
                        "id": 192
                    },
                    {
                        "name": "Body work",
                        "text": "Work that only comes from the head isn’t any\ngood. Watch a great musician play a show. Watch\na great leader give a speech. You'll see what I mean.\n<i>You need to find a way to bring your body into\nyour work. Our nerves aren’t a one-way street.\n—our bodies</i> can tell our brains as much as our\nbrains tell our bodies</i>.",
                        "page": "18",
                        "id": 193
                    },
                    {
                        "name": "Side projects",
                        "text": "One thing I’ve learned in my brief career: <i>It’s the\nside projects that really take off. By side projects I\nmean the stuff that you thought was just messing\naround.</i> Stuff that’s just play. That’s actually the\ngood stuff. That’s when the magic happens.",
                        "page": "19",
                        "id": 194
                    },
                    {
                        "name": "Lot of projects",
                        "text": "<i>I think it’s good to have a lot of projects going\nat once so you can bounce between them.</i>\nWhen you get sick of one project, move over to\nanother, and when you're sick of that one, move\nback to the project you left. ",
                        "page": "20",
                        "id": 195
                    },
                    {
                        "name": "Get bored",
                        "text": "<i>Creative people need time to just sit around\nand do nothing. I get some of my best ideas when\nI’m bored</i>, which is why I never take my shirts\nto the cleaners. I love ironing my shirts—it’s so\nboring. I almost always get good ideas.",
                        "page": "21",
                        "id": 196
                    },
                    {
                        "name": "Avoiding work",
                        "text": "I almost always get good ideas. <i>If you’re out\nof ideas, wash the dishes. Take a really long walk.\nStare at a spot on the wall for as long as you can.</i> As\nthe artist Maira Kalman says, “Avoiding work is the\nway to focus my mind.”",
                        "page": "22",
                        "id": 197
                    },
                    {
                        "name": "Hobby",
                        "text": "<i>It’s so important to have a hobby. A hobby is\nsomething creative that’s just for you.</i> You\ndon’t try to make money or get famous off\nit, you just do it because it makes you happy.\nAhobby is something that gives but doesn’t\ntake.",
                        "page": "23",
                        "id": 198
                    },
                    {
                        "name": "Public image",
                        "text": "This is actually a good thing, because you want\nattention only after you're doing really good work.\n<i>There’s no pressure when you're unknown. You\ncan do what you want. Experiment. Do things just\nfor the fun of it.</i> When you’re unknown, there’s\nnothing to distract you from getting better. No\npublic image to manage.",
                        "page": "24",
                        "id": 199
                    },
                    {
                        "name": "Stuff on internet",
                        "text": "It’s a two-step process. <i>Step one, “do good work,” is\nincredibly hard. There are no shortcuts. Make stuff every\nday. Know you're going to suck for a while. Fail. Get better.</i>\nStep two, “share it with people,” was really hard up until\nabout ten years ago or so. Now, it's very simple: “Put your\nstuff on the Internet.”",
                        "page": "25",
                        "id": 200
                    },
                    {
                        "name": "Ideas incubator",
                        "text": "<i>You don’t put yourself online only because you\nhave something to say—you can put yourself\nonline to find something to say.</i> The Internet can\nbe more than just a resting place to publish your\nfinished ideas—it can also be an incubator for\nideas that aren't fully formed.",
                        "page": "26",
                        "id": 201
                    },
                    {
                        "name": "Travel",
                        "text": "<i>Your brain gets too comfortable in your everyday\nsurroundings. You need to make it uncomfortable.\nYou need to spend some time in another land,</i>\namong people that do things differently than you.\nTravel makes the world look new, and when the\nworld looks new, our brains work harder.",
                        "page": "27",
                        "id": 202
                    },
                    {
                        "name": "Another room",
                        "text": "Harold Ramis, once laid out his rule for\nsuccess: “Find the most talented person in the\nroom, and if it’s not you, go stand next to him.\"\n<i>If you ever find that you're the most talented\nperson in the room, you need to find another room.</i>",
                        "page": "28",
                        "id": 203
                    },
                    {
                        "name": "Anger",
                        "text": "Anger is one of my favorite creative resources.\nSome mornings, when I can’t wake up. I lie in bed\nand read e-mail and Twitter until my blood\nstarts boiling and I get fired up enough to spring\nout of bed. <i>But instead of wasting my anger on\ncomplaining or lashing out at people. I try to\nchannel it into my writing and my drawing.</i>",
                        "page": "29",
                        "id": 204
                    },
                    {
                        "name": "To busy doing",
                        "text": "Not everybody will get it. People will misinterpret\nyou and what you do. They might even call\nyou names. <i>So get comfortable with being\nmisunderstood, disparaged, or ignored—the trick\nis to be too busy doing your work to care.</i>",
                        "page": "30",
                        "id": 205
                    },
                    {
                        "name": "Validation boost",
                        "text": "Life is a lonely business, often filled with\ndiscouragement and rejection. <i>Yes, validation is\nfor parking, but it’s still a tremendous boost when\npeople say nice things about our work.</i>",
                        "page": "31",
                        "id": 206
                    }
                ]
            }
        ]
    },
    {
        "name": "The Modern Javascript",
        "children": [
            {
                "name": "Ilya Kantor",
                "children": [
                    {
                        "name": "Live script",
                        "text": "<i>When JavaScript was created, it initially \nhad another name: “LiveScript”.</i> \nBut Java was very popular at that time, \nso it was decided that positioning \na new language as a “younger brother” of Java would help.",
                        "page": "01",
                        "id": 207
                    },
                    {
                        "name": "Js engine",
                        "text": "<i>Today, JavaScript can execute \nnot only in the browser, but also on the server, \nor actually on any device that has a special \nprogram called the JavaScript engine.</i> \nThe browser has an embedded engine sometimes \ncalled a JavaScript virtual machine.",
                        "page": "02",
                        "id": 208
                    },
                    {
                        "name": "Machine language",
                        "text": "<i>Engines are complicated. \nBut the basics are easy.\nThe engine parses the script then it \ncompiles to the machine language.</i>\nThe engine applies optimizations and runs the code.",
                        "page": "03",
                        "id": 209
                    },
                    {
                        "name": "Safe language",
                        "text": "<i>Modern JavaScript is a safe programming language. \nIt does not provide low-level access to memory or CPU,</i> \nbecause it was initially created for browsers</i> \nwhich do not require it.",
                        "page": "04",
                        "id": 210
                    },
                    {
                        "name": "Environment",
                        "text": "<i>JavaScript’s capabilities greatly depend \non the environment it’s running in.</i>\nFor instance, Node.js supports functions that \nallow JavaScript to read/write arbitrary files, \nperform network requests, etc.",
                        "page": "05",
                        "id": 211
                    },
                    {
                        "name": "In browser js",
                        "text": "<i>In-browser JavaScript can do everything \nrelated to webpage manipulation,</i> \ninteraction with the user, add new HTML to the page, \nchange the existing content, modify styles.",
                        "page": "06",
                        "id": 212
                    },
                    {
                        "name": "Unique",
                        "text": "<i>What makes JavaScript unique?\nIt has full integration with HTML/CSS, \nit is supported by all major browsers \nand it is enabled by default.</i>\nThat’s why it’s the most widespread tool \nfor creating browser interfaces.",
                        "page": "07",
                        "id": 213
                    },
                    {
                        "name": "Use strict",
                        "text": "For a long time, JavaScript evolved \nwithout compatibility issues. \nNew features were added to the language \nwhile old functionality didn’t change.\n<i>That had the benefit of never breaking \nexisting code. But the downside was that \nany mistake or an imperfect decision \nmade by JavaScript’s creators \ngot stuck in the language forever.</i>",
                        "page": "08",
                        "id": 214
                    },
                    {
                        "name": "Null",
                        "text": "<i>In Javascript the result of typeof null is object. \nThat’s an officially recognized error in typeof, \ncoming from very early days of JavaScript \nand kept for compatibility.</i> It is not a \nreference to a non-existing object or a null pointer \nlike in some other languages. \nIt’s just a special type which represents nothing.",
                        "page": "09",
                        "id": 215
                    }
                ]
            }
        ]
    },
    {
        "name": "The Recursive Book of Recursion",
        "children": [
            {
                "name": "Al Sweigart",
                "children": [
                    {
                        "name": "Call stack",
                        "text": "<i>To understand recursion, you need to become familiar with a\nless obvious data structure, called the call stack, that controls the\nprogram's flow of execution.</i> Most programming beginners don’t\nknow about stacks, because programming tutorials often don’t even\nmention them when discussing function calls. ",
                        "page": "01",
                        "id": 216
                    },
                    {
                        "name": "Recursive definition",
                        "text": "<i>A recursive thing is something whose definition includes itself. \nIn a programming context, a recursive function is a function that\ncalls itself.</i> Programmers tend to take function calls for granted, \nbut even experienced programmers will find it worthwhile to review functions.",
                        "page": "02",
                        "id": 217
                    },
                    {
                        "name": "Recursion stacks",
                        "text": "<i>To really understand recursion, you must first understand stacks.\nA stack is one of the simplest data structures in computer science.</i>\nIt stores multiple values like a list does. But, unlike lists, it limits you\nto adding to or removing values from the “top” of the stack only.",
                        "page": "03",
                        "id": 218
                    },
                    {
                        "name": "Frame objects",
                        "text": "<i>The program's call stack is a stack of frame objects.\nFrame objects contain information about a single function call, \nincluding which line of code called the function.</i>\nFrame objects are created and pushed onto the stack when a function is called. \nWhen the function returns, that frame object is popped off the stack.",
                        "page": "04",
                        "id": 219
                    },
                    {
                        "name": "Recursion tricky",
                        "text": "<i>Recursion can be tricky for both beginner and experienced programmers, \nand recursive code isn’t automatically “better” or “more elegant” \nthan iterative code.</i> Readable, easy-to-understand code is more important \nthan any supposed elegance that recursion provides.",
                        "page": "05",
                        "id": 220
                    },
                    {
                        "name": "Binary search bookshelf",
                        "text": "<i>Binary search is a technique for locating a target item in a sorted list\nby repeatedly determining which half of the list the item is in.</i> \nThe most impartial way to search the bookshelf is to start with a book in\nthe middle, and then ascertain if the target book you're looking for is\nin the left half or the right half.",
                        "page": "06",
                        "id": 221
                    },
                    {
                        "name": "Fractals",
                        "text": "<i>Recursion can produce elaborate fractal art using surprisingly \nfew lines of code. Fractals are shapes that repeat themselves.</i> \nFractals include many natural and artificial shapes. In nature, \nyou might see them in the shapes of trees, leaves, snowflakes.",
                        "page": "07",
                        "id": 222
                    }
                ]
            }
        ]
    },
    {
        "name": "Think Python",
        "children": [
            {
                "name": "Allen Downey",
                "children": [
                    {
                        "name": "Teaching java",
                        "text": "<i>In January 1999 I was preparing to teach an introductory\nprogramming class in Java, had taught it three times and I was\ngetting frustrated</i>. The failure rate in the class was too high and,\neven for students who succeeded, the overall level of achievement\n‘was too low.",
                        "page": "01",
                        "id": 223
                    },
                    {
                        "name": "Books problem",
                        "text": "<i>One of the problems I saw was the books. They were too big, with\ntoo much unnecessary detail about Java, and not enough high-level\nguidance about how to program.</i> And they all suffered from the\ntrapdoor effect: they would start out easy, proceed gradually, and\nthen somewhere around Chapter 5 the bottom would fall out. The",
                        "page": "02",
                        "id": 224
                    },
                    {
                        "name": "Book title",
                        "text": "",
                        "page": "03",
                        "id": 225
                    },
                    {
                        "name": "Gnu ptyhon",
                        "text": "I<i>released the book under the GNU Free Documentation License,\nwhich allows users to copy, modify, and distribute the book.\nWhat happened next is the cool part. Jeff Elkner, a high school\nteacher in Virginia, adopted my book and translated it into\nPython. He sent me a copy of his translation, and [had the\nunusual experience of learning Python by reading my own\nbook.</i> As Green Tea Press. I published the first Python version in\n2001.",
                        "page": "04",
                        "id": 226
                    }
                ]
            }
        ]
    }
]