[
    {
        "name": "Coders at work",
        "children": [
            {
                "name": "Brad Fitzpatrick",
                "children": [
                    {
                        "name": "Maintainer for life",
                        "text": "I've also done a lot of testing since LiveJournal.\n<i>Once I started working with other people\nespecially. And once I realized that code I write\nnever fucking goes away and I'm going to be a\nmaintainer for life.</i> I get comments about blog\nposts that are almost 10 years old. “Hey. I found\nthis code. I found a bug,” and I'm suddenly\nmaintaining code.",
                        "id": 1
                    },
                    {
                        "name": "Tests to guard",
                        "text": "to tell them that they messed up. <i>I had to force\na lot of people to write tests, mostly people who\nwere working for me. I would write tests to guard\nagainst my own code breaking, and then once they\nwrote code. I was like, “Are you even sure that\nworks? Write a test. Prove it to me.”</i> At a certain\npoint, people realize, “Holy crap, it does pay off,”\nespecially maintenance costs later.",
                        "id": 2
                    }
                ]
            },
            {
                "name": "Jamie Zawinski",
                "children": [
                    {
                        "name": "Cross platform releases",
                        "text": "welll port it later.” Which is what many other\nfailed companies have done. If you're trying to\nship a cross-platform product, history really shows\nthat's how you don't do it. <i>If you want it to\nreally be cross-platform, you have to do them\nsimultaneously.</i> The porting thing results in a\ncrappy product on the second platform.",
                        "id": 3
                    },
                    {
                        "name": "Multithreading in java",
                        "text": "where it was writing some big file. <i>We took really\ngood advantage of multithreading in Java, which\nwas less painful than I had expected it to be. It was\njust really pleasant to work on.</i> From the API we\nhad designed we saw all these directions it could\ngrow.",
                        "id": 4
                    }
                ]
            }
        ]
    },
    {
        "name": "Passionate Programmer",
        "children": [
            {
                "name": "Chad Fowler",
                "children": [
                    {
                        "name": "Low expectations",
                        "text": "our careers. Most of us are content to go with the\nflow. <i>Our expectations have been lowered for us\nby the media and by our friends, acquaintances,\nand family members</i>. So, leading a remarkable life\nis something you have to discover as even being a\nreasonable goal. It’s not obvious.",
                        "id": 5
                    },
                    {
                        "name": "Loving your work",
                        "text": "<i>If your life is primarily consumed by your work,\nthen loving your work is one of the most\nimportant keys to loving your life.</i> Challenging,\nmotivating, rewarding work is more likely to make\nyou want to get up in the morning than dull,\naverage tasks. Doing your job well means that the\nactivity you do for 50 percent of your available\ntime is something you're good at. Conversely, if you",
                        "id": 6
                    }
                ]
            }
        ]
    }
]